$(function() {

    var songList = new Array(); // 存放歌曲列表中的歌曲
    var bakSongList = new Array(); // 备份歌曲列表
    var isPlaying = false;
    var syncStatus = 0; // 双击列表播放歌曲时会触发多个标签的点击事件，引发播放器短时间内多次调用play()或是设置播放源，导致控制台报错
    var timer; // 改变syncStatus的定时器
    var songChangeTimer; 
    var showLyric = false;
    var currentLrc = "";
    var lrcList = new Array();
    var lrcTimeList = new Array();
    var lyricTimer;
    var curLyricLocation = 0;
    var isLoadLyric = false;
    // 唱片的旋转变量
    var rotateCircle = 0;
    var rotateTimer;
    var canPlay = false;
    /*
    0 列表循环  
    1 单曲循环
    2 随机播放
    */
    var playType = 0;

    // 轮播图
    var sliderList = [
        {id: "0", name: "火影原声", list: [
            {
                singer: [{name: "Akeboshi"}], 
                songUrl: "https://m10.music.126.net/20190430055025/2d9a626c847fd5579647e7314b52de05/ymusic/9e9b/4d03/b0d4/2a6bba4e5e26f605f0598bc2e0a977ed.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000004MqAwD15KeWx.jpg?max_age=2592000", 
                songName: "Wind", 
                interval: "221",
                songLrc: "[00:00.0]未找到歌词"
            },
            {
                singer: [{name: "AZU"}], 
                songUrl: "https://m10.music.126.net/20190430054838/75a3d590509a42a659e887e75783114f/ymusic/6d03/fd10/d190/48b5ae121aedd90222a397abcb80a55b.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000001CczYM1PrYPs.jpg?max_age=2592000", 
                songName: "For You", 
                interval: "257",
                songLrc: "[00:11.58]ここにあるのは  君が今まで選んだ道の[00:17.18]答え達よ  ほら自信もって進めばいい[00:22.70]とても自然なの 雨上がりの[00:25.76]アスファルトに  虹が架かるように[00:34.04]Lonely 風が吹いて  Feeling 気がついたよ[00:39.54]答えはどこにも無いけど[00:44.97]Call me 分かってるわ  With you 愛はいつも[00:50.42]与え合うもの[00:55.19]For You  きっと君はいつの日か[00:58.95]この空を飛べるはずだから[01:01.68]何度つまずいたとしても For You[01:07.14]大切な事は1つ  夢見る事[01:11.54]心だけは閉ざさないでいて[01:20.52][01:25.93][01:27.93]傷ついても涙こらえ  我慢してたよね?[01:33.53]そんな君を一番近くで  見てきたから[01:39.00]何も言わなくても  分かってるよ[01:44.47]どんな時も頑張ってた事[01:50.36]Runaway 迷ったなら  Try again 何度だって[01:55.86]やり直す事できるから[02:01.34]I'm here 側にいるわ  Believing 恐れないで[02:06.77]信じ合うこと[02:11.60]For You  きっと君もいつの日か[02:15.29]この空を飛べるはずだから[02:18.01]何度傷ついたとしても For You[02:23.48]大切な事は1つ  夢見る事[02:27.92]瞳だけはそらさないでいて[02:37.59]君が描く勇気がほら[02:43.22]かけがえのない宝物に変わるよ[02:51.82]今両手ひろげ Fly high[02:58.95]きっと君はいつの日か[03:01.67]この空を飛べるはずだから[03:04.39]何度つまずいたとしても For You[03:09.84]大切な事は1つ  夢見る事[03:14.28]心だけは閉ざさないでいて[03:23.46][03:25.46]TV アニメ 「NARUTO -ナルト- 疾風伝」ED12[03:39.46]収録：AZU - For You (通常盤)／発売日：2010/03/03[03:48.46]"
            },
            {
                singer: [{name: "高梨康治"}, {name: "刃-yaiba-"}], 
                songUrl: "https://m10.music.126.net/20190430055221/819139977fc0877bb2d82ffdd06e0bbd/ymusic/7a65/2f82/ea99/3fa3c1ff7572df06fbdc8dfc79b73fd5.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000001eAFPP0AFhYh.jpg?max_age=2592000", 
                songName: "落葉船", 
                interval: "130",
                songLrc: "[00:00.0]轻音乐请欣赏"
            },
            {
                singer: [{name: "増田俊郎"}], 
                songUrl: "https://m10.music.126.net/20190430055318/9efb0495a8b778e0346d05975d0659d2/ymusic/03c9/6e16/3629/e0376f3ced5edd7c9c3646924124c869.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000004MqAwD15KeWx.jpg?max_age=2592000", 
                songName: "ひとり", 
                interval: "103",
                songLrc: "[00:00.0]未找到歌词"
            },
            {
                singer: [{name: "石崎ひゅーい"}], 
                songUrl: "https://m10.music.126.net/20190430055354/dc5df17ef31f5a87e3cc564a9e0ecece/ymusic/8b76/6078/f2fa/8b523a4ed4dc19501d46881d1be1039f.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M0000016WBhm0zjMjA.jpg?max_age=2592000", 
                songName: "ピノとアメリ", 
                interval: "271",
                songLrc: "[00:00.0]未找到歌词"
            },
            {
                singer: [{name: "スキマスイッチ"}], 
                songUrl: "https://dl.stream.qqmusic.qq.com/C400000a5qKl049ZSq.m4a?vkey=4C94D1210C3755BF4B2395B4F9AFB976D78F50DC51A55B472316F99CC8E2F465B33BB814C4C7C91C6A11740E57F5A4BE87C6247938149554&guid=1227621519&uin=0&fromtag=38", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000001CJE971ev5fd.jpg?max_age=2592000", 
                songName: "星のうつわ", 
                interval: "338",
                songLrc: "[00:00.0]未找到歌词"
            }
        ]},
        {id: "1", name: "轻音乐", list: [
            {
                singer: [{name: "Ayasa"}], 
                songUrl: "http://www.ytmp3.cn/down/59456.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000003kgM6R21GM7Y.jpg?max_age=2592000", 
                songName: "告白の夜", 
                songAlbum: "", 
                interval: "289",
                songLrc: "[00:00.0]轻音乐请欣赏"
            },
            {
                singer: [{name: "広橋真紀子"}], 
                songUrl: "https://m10.music.126.net/20190430061042/41f1a0f515269c15a5f799a32197e167/ymusic/0c97/d622/e70b/d5472bfcdc99af9d6c11e60b002bdaf1.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000003gyGib30T3BQ.jpg?max_age=2592000", 
                songName: "いのちの名前 (生命之名)", 
                songAlbum: "", 
                interval: "349",
                songLrc: "[00:00.0]轻音乐请欣赏"
            },
            {
                singer: [{name: "Key Sounds Label"}], 
                songUrl: "https://m10.music.126.net/20190430055643/e9e1a7cda7b2ffb090db50279c86e31d/ymusic/871b/a4f6/2d2c/85f4680a9f8d4f06a4d79cff02f29df4.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000001f2I4I3jRTAY.jpg?max_age=2592000", 
                songName: "Bloom of Youth", 
                songAlbum: "", 
                interval: "148",
                songLrc: "[00:00.0]轻音乐请欣赏"
            },
            {
                singer: [{name: "Piano Squall"}], 
                songUrl: "https://dl.stream.qqmusic.qq.com/C400004cjBDF1mIFda.m4a?vkey=425A728D0FAB5551DEDD7C3BE5EFF99934CBAB84363873EC906A4E3CB595C9D51915189391615A57CA50B4ADD90B43434EE4481307A0D30C&guid=246442393&uin=0&fromtag=38", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000001THSEv3MoXZx.jpg?max_age=2592000", 
                songName: "Sadness And Sorrow", 
                songAlbum: "", 
                interval: "173",
                songLrc: "[00:00.0]轻音乐请欣赏"
            }
        ]},
        {id: "2", name: "二次元", list: [
            {
                singer: [{name: "米津玄師"}], 
                songUrl: "http://www.ytmp3.cn/down/51031.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002OR8wD3Lo3E5.jpg?max_age=2592000", 
                songName: "Lemon", 
                songAlbum: "", 
                interval: "255",
                songLrc: "[00:00.00]Lemon-米津玄師[00:01.53]词：米津玄師[00:01.55]曲：米津玄師[00:01.60]夢ならば[00:02.88]どれほどよかったでしょう[00:06.88]未だにあなたのことを夢にみる[00:12.41]忘れた物を取りに帰るように[00:17.91]古びた思い出の埃を払う[00:26.27]戻らない幸せがあることを[00:31.73]最後にあなたが教えてくれた[00:37.25]言えずに隠してた昏い過去も[00:42.80]あなたがいなきゃ[00:44.92]永遠に昏いまま[00:48.57]きっともうこれ以上[00:51.36]傷つくことなど[00:54.18]ありはしないとわかっている[00:58.98]あの日の悲しみさえ[01:01.74]あの日の苦しみさえ[01:04.52]そのすべてを愛してた[01:07.28]あなたとともに[01:09.98]胸に残り離れない[01:13.07]苦いレモンの匂い[01:15.84]雨が降り止むまでは帰れない[01:21.39]今でもあなたはわたしの光[01:37.98]暗闇であなたの背をなぞった[01:43.43]その輪郭を鮮明に覚えている[01:48.97]受け止めきれないものと[01:52.20]出会うたび[01:54.50]溢れてやまないのは涙だけ[02:00.32]何をしていたの[02:03.16]何を見ていたの[02:05.92]わたしの知らない横顔で[02:10.69]どこかであなたが今[02:13.43]わたしと同じ様な[02:16.31]涙にくれ[02:17.64]淋しさの中にいるなら[02:21.71]わたしのことなどどうか[02:24.85]忘れてください[02:27.60]そんなことを心から願うほどに[02:33.13]今でもあなたはわたしの光[02:41.64]自分が思うより[02:47.19]恋をしていたあなたに[02:52.72]あれから思うように[02:58.24]息ができない[03:03.33]あんなに側にいたのに[03:09.27]まるで嘘みたい[03:14.40]とても忘れられない[03:20.21]それだけが確か[03:30.81]あの日の悲しみさえ[03:33.41]あの日の苦しみさえ[03:36.22]そのすべてを愛してた[03:38.97]あなたとともに[03:41.67]胸に残り離れない[03:44.77]苦いレモンの匂い[03:47.61]雨が降り止むまでは帰れない[03:53.09]切り分けた果実の片方の様に[03:58.60]今でもあなたはわたしの光"
            },
            {
                singer: [{name: "とあ/nameless"}], 
                songUrl: "https://m10.music.126.net/20190430055741/9be2eb29fe4a4a61cc3cb8ca1ead2368/ymusic/1523/40fc/899a/eac188e0710a9ac1555d55e8c55adcee.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000001WP7KJ2dqKGi.jpg?max_age=2592000", 
                songName: "リグレット", 
                songAlbum: "", 
                interval: "282",
                songLrc: "[by:九三][ti:リグレット][ar:nameless][al:212][0-1:55.200][00:36.130]かたづけて かたづけて[00:39.760]君の時間 僕の時間[00:43.050]鍵かけて 閉じ込めて[00:45.730]未来なんてさ 見えないでしょ[00:49.840]巡らせて 膨らませて[00:53.140]君の思い 僕の期待/[00:56.470]雨上がり 振り返り[00:59.010]届かないよな 見えないよな[01:02.460][01:02.980]引き摺ってんでしょ[01:05.440]目を覚ましてよ ねえ[01:08.130]「もうちょっとあとちょっと」って[01:11.080]いつまでキモチを潰してんの？[01:14.280][01:14.890]知りたいな 触れたいな[01:17.690]このままの距離じゃ見えないな[01:21.480]近づいて すれ違って[01:24.560]こんな僕じゃ愛せないな[01:28.150]意味なんて 理由なんて[01:31.280]とってつけたように並べても[01:34.790]変われないことくらいちゃんと[01:39.600]わかってるんだ[01:41.710][01:43.270]追いかけて 追いかけて[01:46.880]君の時間 僕の時間/[01:50.160]近づけて 遠ざけて[01:52.560]期待はずれの嘘ばっかじゃん[01:56.920]敷きつめて 散りばめて[02:00.200]眺めてたい 忘れてたい[02:03.490]昼下がり 振り返り[02:05.920]夢じゃないよな もう居ないよな[02:09.610][02:10.020]邪魔されてんなら[02:12.580]早く気づいてよ ねえ[02:15.050]「もうちょっとあとちょっと」って[02:18.390]いつまでココロを殺してんの？[02:21.570][02:22.780]言えないな  言えないな[02:25.530]弱虫の僕は要らないな[02:29.260]嘘吐いて 誤魔化して[02:32.350]傷つきたくないのはどっち？[02:35.940]今日もバイバイ 次もバイバイ[02:38.970]そんな瞳めで僕を見つめないで[02:42.560]変われないことくらいちゃんと[02:47.270]わかってるけど…[02:51.210][03:16.230]閉じかけた[03:19.570]開きそうな時間[03:22.940]「もう少し…あと少し…」[03:26.230]とどかない…とどかない…[03:29.980][03:33.270]知りたくて 触れたくて[03:36.260]何度進もうともがいたって[03:39.850]巻き戻して いつもどおり[03:42.980]こんな僕じゃ愛せないな[03:46.530]ねえ壊して また作って[03:49.610]いつまでも距離は変わらないね[03:53.110]戻れないことくらいちゃんと[03:57.970]わかってるでしょ？[04:00.610][04:01.370]…わかってるんだ… …"
            },
            {
                singer: [{name: "とあ/nameless"}], 
                songUrl: "https://m10.music.126.net/20190430063853/908aa87241876bbd11fc66c4c497a0e0/ymusic/8c41/76a9/b076/5a593d542f5a1326cd5a9661ec29cbe0.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000001WP7KJ2dqKGi.jpg?max_age=2592000", 
                songName: "恋の才能", 
                songAlbum: "", 
                interval: "267",
                songLrc: "[by:九九九三三][ti:恋の才能][ar:nameless][al:212][by:九三][00:00.00][00:14.81]気にしてんじゃない？[00:18.35]揺れてんじゃない？[00:21.74]浮かれてんじゃない？[00:25.02]はまってんじゃない？[00:27.62][00:42.84]ばれてんじゃない？[00:46.33]漏れてんじゃない？[00:49.62]避けてんじゃない？[00:53.02]終わってんじゃない？[00:55.62][00:56.63]キラキラした君が大好きです[01:00.09]チラチラ見てるだけで精一杯です[01:03.53]フワフワ つかめないポジティブを[01:06.68]追いかけて 日が暮れて[01:09.81]ねぇ！[01:10.09][01:10.49]「恋の才能なんてないよ！ちょうだいよ！」って[01:13.68]ただの駄々捏ねじゃ はじまらないなー…[01:17.88]届かなくなる前に[01:20.86]少しでも[01:22.24]ねえ少しでも[01:24.36]難攻不落だって[01:27.10]一歩！[01:27.91][01:42.35]足りないんじゃない？[01:45.68]欠けてんじゃない？[01:49.20]怖いんじゃない？[01:52.59]焦ってんじゃない？[01:55.09][01:56.21]イライラして全部放り投げて[01:59.60]ソワソワして結局気になっちゃって[02:02.98]モヤモヤ 消えないネガティブを[02:06.35]追い払って 夜が明けて[02:09.24]もー！[02:09.76][02:10.12]「1,2の3じゃまだ跳べない…」なんて[02:13.16]四の五の言ってたら おいてかれるなー…[02:17.52]逃げられちゃう前に[02:20.50]少しでも[02:21.76]ねえ少しでも[02:23.89]悪戦苦闘したって[02:26.57]一歩！/[02:27.59][02:54.43]要らないんじゃない？[02:57.62]冷めてんじゃない？[03:01.07]呆れてんじゃない？[03:04.71]…やばいんじゃない？ ...[03:06.52][03:08.14]退いてんじゃない？[03:11.43]流してんじゃない？[03:14.87]壊れてんじゃない？[03:17.65]…だけど …[03:18.41]わかんないじゃない[03:20.64]…ねぇ？[03:21.84]…コイノサイノウ…/…[03:22.92][03:23.67]「恋の才能なんてもう要らない!」なんて[03:26.80]1,2の3の、“4”で飛べたらいいなー…[03:30.89]潰れちゃう その前に[03:34.03]少しでも[03:35.25]ねえ少しでも[03:37.42]無我夢中になって"
            },
            {
                singer: [{name: "majiko (まじ娘)"}], 
                songUrl: "https://dl.stream.qqmusic.qq.com/C400004SlTZQ3NWbAO.m4a?vkey=FC5131E6FDFCE565DD1AAB9DD493E70CA2BE941F432CF8B5BFA63DC28B2DBFD7F44B2F7428389F7E25CC6A0D7B7F323E1DC3B9E6AFF353B8&guid=788849075&uin=0&fromtag=38", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002FzKSY0FcypL.jpg?max_age=2592000", 
                songName: "アイロニ", 
                songAlbum: "", 
                interval: "244",
                songLrc: "[00:00.0]未找到无歌词"
            },
            {
                singer: [{name: "花たん"}], 
                songUrl: "https://m10.music.126.net/20190430060632/31dc637602687dc01ee2431a8e755946/ymusic/ab99/7b5a/e95d/63180c017ea00aed7305275be601102b.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T001R300x300M000000UxMkW4RxpBD.jpg?max_age=2592000", 
                songName: "心做し", 
                songAlbum: "", 
                interval: "268",
                songLrc: "[00:00.0]未找到无歌词"
            },
            {
                singer: [{name: "鎖那"}], 
                songUrl: "https://m10.music.126.net/20190430060911/e657688f3ea84ed50e77612c2b2744e5/ymusic/9478/f844/818d/bbf366351ad077e699f9f2cbf7061ed8.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M0000016f2u03s50MX.jpg?max_age=2592000", 
                songName: "言葉のいらない約束", 
                songAlbum: "", 
                interval: "254",
                songLrc: "[00:00.0]未找到无歌词"
            }
        ]},
        {id: "3", name: "蝎", list: [
            // {
            //     singer: [{name: "高梨康治"}, {name: "刃-yaiba-"}], 
            //     songUrl: "http://157.255.154.145/amobile.music.tc.qq.com/C4000003erJ00gnllE.m4a?guid=7068177850&vkey=AB155592DF705A06B94A86014AEAD409D0A48C433F4EA26902A694092B544D19EEB09D5EB22EF725ADAEACE7A2B1E4FEC66C6F52BB1A4213&uin=5875&fromtag=66", 
            //     songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000003xst1Y138xyW.jpg?max_age=2592000", 
            //     songName: "失意", 
            //     songAlbum: "", 
            //     interval: "120"
            // },
            {
                singer: [{name: "花粥"}, {name: "马雨阳"}], 
                songUrl: "http://www.ytmp3.cn/down/48303.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000003iJBH73UYvmi.jpg?max_age=2592000", 
                songName: "盗将行", 
                songAlbum: "", 
                interval: "198",
                songLrc: '[00:05.00]歌名：盗将行[00:10.00]歌手：花粥、马雨阳[00:18.00]劫过九重城关 我座下马正酣[00:23.00]看那轻飘飘的衣摆 趁擦肩把裙掀[00:29.00]踏遍三江六岸 借刀光做船帆[00:35.00]任露水浸透了短衫 大盗睥睨四野[00:43.00]枕风宿雪多年 我与虎谋早餐[00:49.00]拎着钓叟的鱼弦 问卧龙几两钱[00:55.00]蜀中大雨连绵 关外横尸遍野[01:02.00]你的笑像一条恶犬 撞乱了我心弦[01:23.00]谈花饮月赋闲 这春宵艳阳天[01:28.00]待到梦醒时分睁眼 铁甲寒意凛冽[01:34.00]夙愿只隔一箭 故乡近似天边[01:40.00]不知何人浅唱弄弦 我彷徨不可前[01:51.00]枕风宿雪多年 我与虎谋早餐[01:57.00]拎着钓叟的鱼弦 问卧龙几两钱[02:03.00]蜀中大雨连绵 关外横尸遍野[02:09.00]你的笑像一条恶犬 撞乱我心弦[02:15.00]烽烟万里如衔 掷群雄下酒宴[02:22.00]谢绝策勋十二转 想为你窃玉簪[02:28.00]入巷间吃汤面 笑看窗边飞雪[02:34.00]取腰间明珠弹山雀 立枇杷于庭前[02:45.00]入巷间吃汤面 笑看窗边飞雪[02:53.00]取腰间明珠弹山雀 立枇杷于庭前'
            }
            
        ]},
        {id: "4", name: "鼬", list: [
            {
                singer: [{name: "FLOW"}], 
                songUrl: "http://112.90.152.146/amobile.music.tc.qq.com/C400000y1RuM0DPQpj.m4a?guid=7068177850&vkey=3D6823917C8DD2B5F99EE78CE5AB83A1EB56E17BCA1AAA33454007AE7A1CEBC5EFC5EB9A14222C2B8D21F9A29DDFCAFBDCCA85ECCC989272&uin=5875&fromtag=66", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M0000014XLHX0FQZHQ.jpg?max_age=2592000", 
                songName: "Sign", 
                songAlbum: "", 
                interval: "236",
                songLrc: "[00:00.0]未找到无歌词"
            },
            {
                singer: [{name: "HALCALI"}], 
                songUrl: "https://m10.music.126.net/20190430060744/d3757ad7fdfc26622130293d22921858/ymusic/a425/33f4/16d4/b3eaed787faa0844907d891167befcd6.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000000ihzmW0sGNWt.jpg?max_age=2592000", 
                songName: "Long Kiss Good Bye", 
                songAlbum: "", 
                interval: "246",
                songLrc: "[00:00.0]未找到无歌词"
            }
        ]}
    ];

    // 新歌
    var newSongList = [
        {listId: "0", list: [
            {
                singer: [{name: "周杰伦"}], 
                songAlbum: "魔杰座",
                songUrl: "http://www.ytmp3.cn/down/46383.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002Neh8l0uciQZ.jpg?max_age=2592000", 
                songName: "稻香", 
                interval: "223",
                songLrc: "[ti:稻香][ar:周杰伦][al:魔杰座][by:][offset:0][00:00.00]稻香 - 周杰伦 (Jay Chou)[00:10.22]词：周杰伦[00:20.44]曲：周杰伦[00:30.66]对这个世界如果你有太多的抱怨[00:34.11]跌倒了就不敢继续往前走[00:37.07]为什么人要这么的脆弱堕落[00:41.50]请你打开电视看看[00:43.05]多少人为生命在努力勇敢的走下去[00:47.03]我们是不是该知足[00:49.46]珍惜一切就算没有拥有[00:52.92][00:54.04]还记得你说家是唯一的城堡[00:57.63]随着稻香河流继续奔跑[01:00.57]微微笑 小时候的梦我知道[01:04.34][01:05.73]不要哭让萤火虫带着你逃跑[01:09.24]乡间的歌谣永远的依靠[01:12.17]回家吧 回到最初的美好[01:16.87][01:41.00]不要这么容易就想放弃[01:43.14]就像我说的[01:44.54]追不到的梦想换个梦不就得了[01:47.58]为自己的人生鲜艳上色[01:49.88]先把爱涂上喜欢的颜色[01:52.56]笑一个吧[01:53.61]功成名就不是目的[01:55.61]让自己快乐快乐这才叫做意义[01:58.58]童年的纸飞机[02:00.10]现在终于飞回我手里[02:02.88][02:04.29]所谓的那快乐[02:05.72]赤脚在田里追蜻蜓追到累了[02:08.70]偷摘水果被蜜蜂给叮到怕了[02:11.74]谁在偷笑呢[02:13.24]我靠着稻草人[02:14.49]吹着风 唱着歌 睡着了[02:17.55]午后吉他在虫鸣中更清脆[02:19.66][02:20.45]阳光洒在路上就不怕心碎[02:23.17]珍惜一切 就算没有拥有[02:26.28][02:27.76]还记得你说家是唯一的城堡[02:31.33]随着稻香河流继续奔跑[02:34.19]微微笑 小时候的梦我知道[02:38.03][02:39.25]不要哭让萤火虫带着你逃跑[02:42.94]乡间的歌谣永远的依靠[02:46.01]回家吧 回到最初的美好[02:51.09]还记得你说家是唯一的城堡[02:54.73]随着稻香河流继续奔跑[02:57.67]微微笑 小时候的梦我知道[03:01.73][03:02.78]不要哭让萤火虫带着你逃跑[03:06.44]乡间的歌谣永远的依靠[03:09.40]回家吧 回到最初的美好"
            }
        ]},
        {listId: "1", list: [
            {
                singer: [{name: "周杰伦"}], 
                songAlbum: "范特西",
                songUrl: "http://dl.stream.qqmusic.qq.com/M5000009BCJK1nRaad.mp3?vkey=F7751985821ACCCC0A7557E99BE9B847BCCF168736D56DBCBD671292941EFF1BA5B86836303CD75828872DFD8513CDA3DAB276D5113C043D&guid=5150825362&fromtag=1", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000000I5jJB3blWeN.jpg?max_age=2592000", 
                songName: "简单爱", 
                interval: "271",
                songLrc: "[ti:简单爱][ar:周杰伦][al:范特西][by:][offset:0][00:00.00]简单爱 - 周杰伦 (Jay Chou)[00:06.73]词：徐若瑄[00:13.47]曲：周杰伦[00:20.20]编曲：林迈可[00:26.94]说不上为什么 我变得很主动[00:30.79][00:31.66]若爱上一个人 什么都会值得去做[00:36.65]我想大声宣布 对你依依不舍[00:41.08][00:41.65]连隔壁邻居都猜到我现在的感受[00:46.08][00:46.64]河边的风 在吹着头发 飘动[00:51.59]牵着你的手 一阵莫名感动[00:56.46]我想带你 回我的外婆家[01:00.39]一起看着日落 一直到我们都睡着[01:05.89][01:06.70]我想就这样牵着你的手不放开[01:11.25]爱能不能够永远单纯没有悲哀[01:15.93]我 想带你骑单车[01:18.37]我 想和你看棒球[01:20.92]想这样没担忧[01:23.48]唱着歌 一直走[01:25.66][01:26.23]我想就这样牵着你的手不放开[01:31.03]爱可不可以简简单单没有伤害[01:35.65]你 靠着我的肩膀[01:38.21]你 在我胸口睡着[01:40.58][01:41.48]像这样的生活[01:43.35]我爱你 你爱我[01:45.98]想 简简单单 爱[01:50.65][01:55.47]想 简简单单 爱[02:01.71][02:06.08]我想大声宣布 对你依依不舍[02:10.70]连隔壁邻居都猜到我现在的感受[02:15.75]河边的风 在吹着头发 飘动[02:20.25]牵着你的手 一阵莫名感动[02:25.36]我想带你 回我的外婆家[02:29.48]一起看着日落 一直到我们都睡着[02:35.16]我想就这样牵着你的手不放开[02:40.15]爱能不能够永远单纯没有悲哀[02:45.02]我 想带你骑单车[02:47.45]我 想和你看棒球[02:50.01]想这样没担忧[02:52.50]唱着歌 一直走[02:55.19]我想就这样牵着你的手不放开[03:00.18]爱可不可以简简单单没有伤害[03:04.86]你 靠着我的肩膀[03:07.30]你 在我胸口睡着[03:09.85]像这样的生活[03:12.22]我爱你 你爱我[03:14.60][03:15.43]想 简简单单 爱[03:20.92][03:24.44]想 简简单单 爱[03:30.18][03:35.17]我想就这样牵着你的手不放开[03:39.73]爱能不能够永远单纯没有悲哀[03:44.47]我 想带你骑单车[03:46.84]我 想和你看棒球[03:49.34]想这样没担忧[03:51.99]唱着歌 一直走[03:54.05][03:54.61]我想就这样牵着你的手不放开[03:59.48]爱可不可以简简单单没有伤害[04:04.16]你 靠着我的肩膀[04:06.59]你 在我胸口睡着[04:09.15]像这样的生活[04:11.67]我爱你 你爱我"
            }
        ]},
        {listId: "2", list: [
            {
                singer: [{name: "周杰伦"}], 
                songAlbum: "魔杰座",
                songUrl: "http://www.ytmp3.cn/down/69834.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002Neh8l0uciQZ.jpg?max_age=2592000", 
                songName: "给我一首歌的时间", 
                interval: "253",
                songLrc: "[ti:给我一首歌的时间][ar:周杰伦][al:魔杰座][by:][offset:0][00:00.00]给我一首歌的时间 - 周杰伦 (Jay Chou)[00:04.60]词：周杰伦[00:09.21]曲：周杰伦[00:13.81]编曲：林迈可[00:18.42]雨淋湿了天空 毁得更讲究[00:22.60]你说你不懂 为何在这时牵手[00:26.03][00:26.61]我晒干了沉默 悔得很冲动[00:30.71]就算这是做错 也只是怕错过[00:35.10]在一起叫梦 分开了叫痛[00:39.14]是不是说 没有做完的梦最痛[00:43.15]迷路的后果 我能承受[00:46.40]这最后的出口 在爱过了才有[00:52.29][00:53.38]能不能给我一首歌的时间[00:57.37]紧紧的把那拥抱变成永远[01:01.44]在我的怀里你不用害怕失眠[01:05.46]哦 如果你想忘记我也能失忆[01:09.06][01:09.60]能不能给我一首歌的时间[01:13.61]把故事听到最后才说再见[01:17.72]你送我的眼泪 让它留在雨天[01:21.69]哦 越过你划的线[01:23.93]我定了勇气的终点[01:28.96][01:31.80]雨淋湿了天空 毁得很讲究[01:35.70]你说你不懂 我为何在这时牵手[01:39.16][01:39.73]我晒干了沉默 悔得很冲动[01:43.99]就算这是做错 也只是怕错过[01:48.30]在一起叫梦 分开了叫痛[01:52.31]是不是说 没有做完的梦最痛[01:56.33]迷路的后果 我能承受[01:59.60]这最后的出口 在爱过了才有[02:06.59]能不能给我一首歌的时间[02:10.57]紧紧的把那拥抱变成永远[02:14.64]在我的怀里你不用害怕失眠[02:18.67]哦 如果你想忘记我也能失忆[02:22.79]能不能给我一首歌的时间[02:26.87]把故事听到最后才说再见[02:30.91]你送我的眼泪 让它留在雨天[02:34.98]哦 越过你划的线[02:37.18]我定了勇气的终点[02:42.50][02:43.16]哦 你说我不该 不该[02:45.87]不该在这时候说了我爱你[02:50.97][02:52.49]要怎么证明我没有说谎的力气[02:59.49]哦 请告诉我暂停算不算放弃[03:07.46][03:08.78]我只有一天的回忆[03:15.16][03:15.67]能不能给我一首歌的时间[03:19.68]紧紧的把那拥抱变成永远[03:23.79]在我的怀里你不用害怕失眠[03:27.83]哦 如果你想忘记我也能失忆[03:31.42][03:32.05]能不能给我一首歌的时间[03:36.01]把故事听到最后[03:37.57]把故事听到最后才说再见[03:39.99][03:40.68]你送我的眼泪 让它留在雨天[03:44.16][03:44.74]哦 越过你划的线[03:46.54]我定了勇气的终点[03:50.09]你说我不该 不该[03:51.45]不该在这时说了爱你[03:53.52]要怎么证明我没力气[03:55.81]告诉我暂停算不算放弃[03:57.77]你说我不该 不该[03:59.54]不该在这时才说爱你[04:01.63]要怎么证明我没有力气[04:03.99]我只有一天的回忆"
            }
        ]},
        {listId: "3", list: [
            {
                singer: [{name: "周杰伦"}], 
                songAlbum: "十二新作",
                songUrl: "http://www.ytmp3.cn/down/39033.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000003Ow85E3pnoqi.jpg?max_age=2592000", 
                songName: "明明就", 
                interval: "258",
                songLrc: "[ti:明明就][ar:周杰伦][al:十二新作][by:][offset:0][00:00.00]明明就 (夢で逢うだろう) - 周杰伦 (Jay Chou)[00:04.81]词：方文山[00:09.63]曲：周杰伦[00:14.44]编曲：黄雨勋[00:19.26]糖果罐里好多颜色[00:23.56]微笑却不甜了[00:27.74]你的某些快乐[00:30.92]在没有我的时刻[00:34.67][00:36.29]中古世纪的城市里[00:40.53]我想就走到这[00:44.77]海鸥不再眷恋大海[00:49.02]可以飞更远[00:51.58]远方传来风笛[00:55.94]我只在意有你的消息[01:00.12]城堡为爱守着秘密[01:04.37]而我为你守着回忆[01:08.05]明明就 不习惯 牵手[01:12.42]为何却主动把手勾[01:16.54]你的心事太多[01:20.28]我不会戳破[01:23.71][01:25.09]明明就 他比较 温柔[01:29.39]也许他能给你更多[01:34.63]不用抉择 我会自动变朋友[01:40.56][01:56.97]糖果罐里好多颜色[02:01.21]微笑却不甜了[02:05.52]你的某些快乐[02:08.64]在没有我的时刻[02:12.26][02:13.95]中古世纪的城市里[02:18.19]我想就走到这[02:22.37]海鸥不再眷恋大海[02:26.61]可以飞更远[02:29.36]远方传来风笛[02:33.47]我只在意有你的消息[02:37.78]城堡为爱守着秘密[02:42.09]而我为你守着回忆[02:45.77]明明就 不习惯 牵手[02:50.14]为何却主动把手勾[02:54.19]你的心事太多 我不会戳破[03:02.75]明明就 他比较 温柔[03:07.05]也许他能给你更多[03:12.29]不用抉择 我会自动变朋友[03:18.41][03:35.56]明明就 明明就[03:37.37]明明就 他比较 温柔[03:41.37]也许他能给你更多[03:46.38]不用抉择 我会自动变朋友"
            }
        ]},
        {listId: "4", list: [
            {
                singer: [{name: "周杰伦"}], 
                songAlbum: "魔杰座",
                songUrl: "http://www.ytmp3.cn/down/69841.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002Neh8l0uciQZ.jpg?max_age=2592000", 
                songName: "说好的幸福呢", 
                interval: "256",
                songLrc: "[ti:说好的幸福呢][ar:周杰伦][al:闪亮2008 Hit Fm 年度百首单曲][by:][offset:0][00:00.00]说好的幸福呢 - 周杰伦 (Jay Chou)[00:05.70]词：方文山[00:11.40]曲：周杰伦[00:17.10]编曲：钟兴民[00:22.80]你的回话凌乱着[00:26.42][00:27.09]在这个时刻[00:30.16][00:30.76]我想起喷泉旁的白鸽[00:35.30]甜蜜散落了[00:38.10][00:38.83]情绪莫名的拉扯[00:42.41][00:43.44]我还爱你呢[00:46.93]而你断断续续唱着歌[00:51.07][00:51.58]假装没事了[00:54.69]时间过了走了[00:57.20]爱情面临选择[00:59.80]你冷了倦了我哭了[01:03.18]离开时的不快乐[01:05.20]你用卡片手写着[01:07.19]有些爱只给到这[01:08.98]真的痛了[01:12.43][01:13.41]怎么了你累了说好的[01:16.38]幸福呢[01:17.45]我懂了不说了[01:19.44]爱淡了梦远了[01:21.48]开心与不开心一一[01:23.56]细数着你再不舍[01:25.57]那些爱过的感觉都太深刻[01:28.43]我都还记得[01:30.42]你不等了说好的[01:32.69]幸福呢[01:33.74]我错了泪干了[01:35.78]放手了后悔了[01:37.86]只是回忆的音乐盒[01:39.91]还旋转着要怎么停呢[01:44.75][01:56.72]你的回话凌乱着[01:59.92][02:01.06]在这个时刻[02:04.17][02:04.77]我想起喷泉旁的白鸽[02:08.70][02:09.23]甜蜜散落了[02:12.18][02:12.77]情绪莫名的拉扯[02:16.37][02:17.42]我还爱你呢[02:21.00]而你断断续续唱着歌[02:25.57]假装没事了[02:28.59]时间过了走了[02:31.07]爱情面临选择[02:33.19][02:33.72]你冷了倦了我哭了[02:37.09]离开时的不快乐[02:39.12]你用卡片手写着[02:41.15]有些爱只给到这真的痛了[02:46.66][02:47.37]怎么了你累了[02:49.34]说好的幸福呢[02:51.39]我懂了不说了[02:53.41]爱淡了梦远了[02:55.46]开心与不开心一一[02:57.52]细数着你再不舍[02:59.55]那些爱过的感觉都太深刻[03:02.30]我都还记得[03:04.39]你不等了说好的幸福呢[03:07.71]我错了泪干了[03:09.73]放手了后悔了[03:11.79]只是回忆的音乐盒[03:13.84]还旋转着[03:15.45]要怎么停呢[03:19.00][03:19.64]怎么了你累了[03:23.39][03:24.21]说好的幸福呢[03:27.95]我懂了不说了爱淡了[03:34.16]梦远了我都还记得[03:37.08]你不等了说好的幸福呢[03:40.38]我错了泪干了[03:42.41]放手了后悔了[03:44.45]只是回忆的音乐盒[03:46.54]还旋转着[03:48.09]要怎么停呢"
            }
        ]},
        {listId: "5", list: [
            {
                singer: [{name: "周杰伦"}], 
                songAlbum: "七里香",
                songUrl: "http://www.ytmp3.cn/down/52796.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000003DFRzD192KKD.jpg?max_age=2592000", 
                songName: "借口", 
                interval: "258",
                songLrc: "[ti:借口][ar:周杰伦][al:七里香][by:][offset:0][00:00.00]借口 - 周杰伦 (Jay Chou)[00:05.12]词：周杰伦[00:10.24]曲：周杰伦[00:15.36]翻着我们的照片[00:18.50]想念若隐若现[00:21.28][00:22.10]去年的冬天[00:25.40][00:25.92]我们笑得很甜[00:29.22][00:30.04]看着你哭泣的脸[00:33.23]对着我说再见[00:36.20][00:36.79]来不及听见[00:39.97][00:40.48]你已走得很远[00:43.61][00:44.19]也许你已经放弃我[00:47.87]也许已经很难回头[00:51.62]我知道是自己错过[00:55.15]请再给我一个理由说你不爱我[01:03.02]就算是我不懂[01:06.61]能不能原谅我[01:10.25]请不要把分手当作你的请求[01:16.74][01:17.66]我知道坚持要走是你受伤的借口[01:24.47]请你回头[01:26.29]我会陪你一直走到最后[01:32.36]就算没有结果[01:35.97]我也能够承受[01:39.60]我知道你的痛[01:42.76]是我给的承诺[01:46.31][01:46.91]你说给过我纵容[01:50.60]沉默是因为包容[01:53.86]如果要走请你记得我[02:01.07][02:12.79]翻着我们的照片[02:15.90]想念若隐若现[02:19.53]去年的冬天[02:23.22]我们笑得很甜[02:26.55][02:27.34]看着你哭泣的脸[02:30.56]对着我说再见[02:33.56][02:34.10]来不及听见[02:37.81]你已走得很远[02:41.54]也许你已经放弃我[02:45.21]也许已经很难回头[02:48.88]我知道是自己错过[02:52.56]请再给我一个理由说你不爱我[03:00.32]就算是我不懂[03:03.96]能不能原谅我[03:07.62]请不要把分手当作你的请求[03:14.42][03:14.97]我知道坚持要走是你受伤的借口[03:21.89]请你回头[03:23.74]我会陪你一直走到最后[03:29.68]就算没有结果[03:33.29]我也能够承受[03:37.03]我知道你的痛[03:40.37]是我给的承诺[03:43.58][03:44.41]你说给过我纵容[03:47.92]沉默是因为包容[03:51.13]如果要走请你记得我[03:59.39][04:02.40]如果难过请你忘了我"
            }
        ]},
        {listId: "6", list: [
            {
                singer: [{name: "周杰伦"}], 
                songAlbum: "七里香",
                songUrl: "http://www.ytmp3.cn/down/69839.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000003DFRzD192KKD.jpg?max_age=2592000", 
                songName: "搁浅", 
                interval: "238",
                songLrc: "[ti:搁浅][ar:周杰伦][al:七里香][by:][offset:0][00:00.00]搁浅 - 周杰伦 (Jay Chou)[00:05.44]词：宋健彰[00:10.89]曲：周杰伦[00:16.34]久未放晴的天空[00:20.13]依旧留着你的笑容[00:24.25]哭过却无法掩埋歉疚[00:30.95][00:31.92]风筝在阴天搁浅[00:35.33][00:35.87]想念还在等待救援[00:39.48][00:40.02]我拉着线复习你给的温柔[00:46.08][00:46.67]曝晒在一旁的寂寞[00:49.99][00:50.72]笑我给不起承诺[00:53.98]怎么会怎么会你竟原谅了我[01:00.29][01:01.05]我只能永远读着对白[01:05.61]读着我给你的伤害[01:09.53]我原谅不了我[01:12.19]就请你当作我已不在[01:16.78]我睁开双眼看着空白[01:21.26]忘记你对我的期待[01:25.29]读完了依赖[01:27.91]我很快就离开[01:34.02][01:54.05]久未放晴的天空[01:57.94]依旧留着你的笑容[02:01.79][02:02.30]哭过却无法掩埋歉疚[02:08.58][02:09.64]风筝在阴天搁浅[02:12.91][02:13.50]想念还在等待救援[02:18.41]我拉着线复习你给的温柔[02:23.72][02:24.29]曝晒在一旁的寂寞[02:27.55][02:28.52]笑我给不起承诺[02:31.80]怎么会怎么会你竟原谅了我[02:38.17][02:39.01]我只能永远读着对白[02:43.32]读着我给你的伤害[02:47.30]我原谅不了我[02:50.06]就请你当作我已不在[02:54.58]我睁开双眼看着空白[02:58.95]忘记你对我的期待[03:02.98]读完了依赖[03:05.06][03:05.78]我很快就[03:07.91][03:08.98]我只能永远读着对白[03:14.63]读着我给你的伤害[03:18.53]我原谅不了我[03:21.27]就请你当作我已不在[03:25.24][03:26.10]我睁开双眼看着空白[03:30.20]忘记你对我的期待[03:34.18]读完了依赖[03:36.39][03:37.05]我很快就离开"
            }
        ]},
        {listId: "7", list: [
            {
                singer: [{name: "周杰伦"}], 
                songAlbum: "七里香",
                songUrl: "http://www.ytmp3.cn/down/57705.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000001uqejs3d6EID.jpg?max_age=2592000", 
                songName: "手写的从前", 
                interval: "297",
                songLrc: "[ti:08-手写的从前][ar:是][al:][by:][offset:0][00:00.00]手写的从前 (优酸乳为爱告白广告曲) - 周杰伦 (Jay Chou)[00:03.68]词：方文山[00:07.37]曲：周杰伦[00:11.06]这风铃跟心动很接近[00:15.15][00:16.22]这封信还在怀念旅行[00:20.43][00:21.26]路过的爱情都太年轻[00:25.45]你是我想要 再回去的风景[00:30.62][00:31.51]这别离被瓶装成秘密[00:35.98]这雏菊美得像诗句[00:39.07]而我在风中等你 的消息[00:44.20]等月光落雪地[00:47.22][00:48.47]等枫红染秋季等相遇[00:52.21][00:52.82]我重温午后的阳光[00:58.00]将吉他斜背在肩上[01:02.86]跟多年前一样 我们轻轻地唱[01:07.92]去任何地方[01:10.91][01:14.33]我看着你的脸 轻刷着和弦[01:19.66]情人节卡片 手写的永远[01:23.81]还记得广场公园 一起表演[01:28.95]校园旁糖果店 记忆里在微甜[01:34.66]我看着你的脸 轻刷着和弦[01:40.08]初恋是整遍 手写的从前[01:44.07]还记得那年秋天 说了再见[01:49.26]当恋情已走远[01:51.88]我将你深埋在 心里面[01:56.18][02:15.82]微风需要竹林 溪流需要蜻蜓[02:18.34]乡愁般的离开 需要片片浮萍[02:20.93]记得那年的雨季 回忆里特安静[02:23.66]哭过后的决定 是否还能进行[02:26.31]我傻傻等待 傻傻等春暖花开[02:28.68]等终等于等明等白 等爱情回来[02:31.14]青春属于表白 阳光属于窗台[02:33.69]而我想我属于[02:34.75]一个拥有你的未来[02:36.35]纸上的彩虹 用素描画的钟[02:38.91]我还在修改 回忆之中你的笑容[02:41.43]该怎么去形容 为思念酝酿的痛[02:43.96]夜空霓虹 都是我不要的繁荣[02:46.45]或许去趟沙滩 或许去看看夕阳[02:48.97]或许任何一个可以想心事的地方[02:51.67]情绪在咖啡馆 被调成一篇文章[02:54.27]彻底爱上你如诗一般透明的泪光[02:56.65]我看着你的脸 轻刷着和弦[03:00.85][03:01.77]情人节卡片 手写的永远[03:05.92]还记得广场公园 一起表演[03:11.02]校园旁糖果店 记忆里在微甜[03:16.76]我看着你的脸 轻刷着和弦[03:22.18]初恋是整遍 手写的从前[03:26.23]还记得那年秋天 说了再见[03:31.36]当恋情已走远[03:33.89]我将你深埋在 心里面[03:38.10][03:38.74]我重温午后的阳光[03:43.23][03:43.88]将吉他斜背在肩上[03:48.71]跟多年前一样 我们轻轻地唱[03:53.83]去任何地方[03:57.78][04:00.28]我看着你的脸 轻刷着和弦[04:05.64]情人节卡片 手写的永远[04:09.76]还记得广场公园 一起表演[04:14.76]校园旁糖果店 记忆里在微甜[04:20.58]我看着你的脸 轻刷着和弦[04:25.17][04:25.98]初恋是整遍 手写的从前[04:30.15]还记得那年秋天 说了再见[04:35.19]当恋情已走远[04:37.78]我将你深埋在 心里面"
            }
        ]}
    ];

    // 歌单
    var songListList = [
        // 最佳歌单保留
        {},
        {
            listId: "1", 
            listPic: "https://p.qpic.cn/music_cover/AhbCa0vazSRDjEJhYwthgiaicOJR0gBcgGibPlRJK7Vy2fsSWQ9EQcOyQ/300?n=1", 
            listName: "校园广播站 • 经典励志曲", 
            list: [
            {
                singer: [{name: "张韶涵"}], 
                songAlbum: "有形的翅膀",
                songUrl: "http://www.ytmp3.cn/down/47848.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000004NbEqF406qjd.jpg?max_age=2592000", 
                songName: "淋雨一直走", 
                interval: "204",
                songLrc: "[ti:淋雨一直走][ar:张韶涵][al:有形的翅膀][by:][offset:0][00:00.00]淋雨一直走 (Keep Walking) - 张韶涵 (Angela Zhang)[00:00.78]词：姚若龙[00:01.57]曲：Hermanni Kovalainen/Ilanguaq Lumholt/Henrik Tala[00:02.36]Oh[00:04.54]人都应该有梦[00:07.13]有梦就别怕痛[00:11.47]有雷声在轰不停[00:14.03]雨泼进眼里看不清[00:16.64]谁急速狂飙[00:18.02]溅我一身[00:19.57]的泥泞[00:21.63]我决定我想去哪里[00:24.25]往天堂要跳过地狱[00:26.88]也不恐惧[00:28.32]不逃避[00:30.22]这不是脾气[00:32.72]是所谓志气[00:35.27]与勇气[00:36.59]你能推我下悬崖[00:39.09]我能学会飞行[00:41.00]从不听[00:43.19]谁的命令[00:45.48]很独立[00:46.75]耳朵用来听自己的心灵[00:51.31]淋雨一直走[00:53.75]是一颗宝石就该闪烁[00:56.97]人都应该有梦[00:58.39]Oh[00:59.40]有梦就别怕痛[01:01.53]淋雨一直走[01:04.00]是道阳光就该暖和[01:07.12]人都应该有梦[01:08.73]Oh[01:09.62]有梦就别怕痛[01:13.65][01:14.96]有前面盘旋的秃鹰[01:17.77]有背后尖酸的耳语[01:20.39]黑色的童话[01:21.83]是给长大[01:23.45]的洗礼[01:25.48]要独特才是流行[01:28.11]无法复制的自己[01:30.52]让我连受伤[01:32.08]也有型[01:34.01]这不是脾气[01:36.51]是所谓志气[01:39.07]与勇气[01:40.35]你能推我下悬崖[01:42.85]我能学会飞行[01:44.83]从不听[01:46.98]谁的命令[01:49.35]很独立[01:50.57]耳朵用来听自己的心灵[01:54.98]淋雨一直走[01:57.49]是一颗宝石就该闪烁[02:00.71]人都应该有梦[02:02.15]Oh[02:03.28]有梦就别怕痛[02:05.25]淋雨一直走[02:07.84]是道阳光就该暖和[02:10.95]人都应该有梦[02:12.69]Oh[02:13.32]有梦就别怕痛[02:16.99]有时掉进黑洞[02:19.18]有时候爬上彩虹[02:21.64]在下一秒钟[02:22.89]命运如何转动[02:24.07]没有人会晓得[02:25.38]Oh[02:26.69]我说希望无穷[02:29.35]你猜美梦成空[02:31.94]相信和怀疑[02:33.44]总要决斗[02:38.39]淋雨一直走[02:40.99]是一颗宝石就该闪烁[02:44.13]人都应该有梦[02:45.88]Oh[02:46.63]有梦就别怕痛[02:48.66]淋雨一直走[02:51.20]是道阳光就该暖和[02:54.28]人都应该有梦[02:56.15]Oh[02:56.84]有梦就别怕痛[02:58.94]淋雨一直走[03:01.42]是一颗宝石就该闪烁[03:04.56]人都应该有梦[03:06.31]Oh[03:07.00]有梦就别怕痛[03:09.15]淋雨一直走[03:11.63]是道阳光就该暖和[03:14.71]人都应该有梦[03:16.46]Oh[03:17.21]有梦就别怕痛"
            },
            {
                singer: [{name: "王力宏"}], 
                songAlbum: "改变自己",
                songUrl: "http://www.ytmp3.cn/down/43368.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002Zwh5p4HgecI.jpg?max_age=2592000", 
                songName: "改变自己", 
                interval: "194",
                songLrc: "[ti:改变自己][ar:王力宏][al:改变自己][by:][offset:0][00:00.00]改变自己 - 王力宏 (Leehom Wang)[00:06.69]词：王力宏[00:13.39]曲：王力宏[00:20.09]今早起床了[00:21.47][00:22.33]看镜子里的我[00:23.85][00:24.70]忽然发现我发型[00:26.53]睡得有点Kuso[00:28.58][00:29.30]一点点改变[00:30.72][00:31.40]有很大的差别[00:32.87][00:33.68]你我的力量[00:35.19]也能改变世界[00:36.63][00:38.52]最近比较烦[00:39.82][00:40.73]最近情绪很Down[00:42.23][00:42.97]每天看新闻[00:44.66]都会很想大声尖叫[00:46.71][00:47.69]但脏话没用[00:49.04][00:49.73]大家只会嫌凶[00:51.41][00:52.00]我改变自己[00:53.37]发现大有不同[00:55.13][00:56.53]新一代的朋友[00:58.08]我们好好的加油[00:59.86][01:00.91]大家一起大声地说[01:03.21]Na na na na na[01:04.91][01:07.33]我可以改变世界[01:09.29][01:09.89]改变自己[01:11.03][01:12.26]改变隔膜[01:14.04][01:14.66]改变小气[01:15.73][01:16.45]要一直 努力 努力[01:19.08]永不放弃[01:20.20][01:20.82]才可以改变世界[01:23.28]Come on 改变自己[01:24.89][01:31.41]今早起床了[01:32.71][01:33.59]觉得头有点痛[01:34.93][01:35.86]可能是二氧化碳太多[01:38.07]氧气不够[01:39.42][01:40.32]一点点改变[01:41.86][01:42.66]有很大的差别[01:44.13][01:44.89]你我的热情[01:46.48]也能改变世界[01:47.79][01:49.66]只能代表自己[01:51.20][01:51.82]没有政治立场[01:53.25][01:54.03]即使这世界[01:55.45]让我看得十分紧张[01:57.70][01:58.74]要调整自己[02:00.10][02:03.42]没想到一点[02:04.56]就能画龙点睛[02:06.03][02:07.60]新一代的朋友[02:09.26]我们好好的加油[02:10.86][02:12.23]大家一起大声地说[02:14.36]Na na na na na[02:15.79][02:18.48]我可以改变世界[02:20.55][02:21.07]改变自己[02:22.41][02:23.40]改变隔膜[02:25.12][02:25.71]改变小气[02:26.73][02:27.46]要一直 努力 努力[02:30.21]永不放弃[02:31.35][02:31.99]才可以改变世界[02:34.66]Come on 改变自己[02:36.00][02:55.34]我可以改变世界[02:57.21][02:57.95]改变自己[02:59.03][03:00.05]改变隔膜[03:01.85][03:02.52]改变小气[03:03.51][03:04.27]要一直 努力 努力[03:06.50][03:07.02]永不放弃[03:08.26][03:08.79]才可以改变世界[03:11.35]Come on 改变自己"
            }
        ]},
        {
            listId: "2", 
            listPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002rWc0539KOwa.jpg?n=1", 
            listName: "不同的声音", 
            list: [
            {
                singer: [{name: "韩红"}, {name: "林俊杰"}], 
                songAlbum: "飞云之下",
                songUrl: "http://www.ytmp3.cn/down/57208.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000000XAvOz4exGKL.jpg?max_age=2592000", 
                songName: "飞云之下", 
                interval: "266",
                songLrc: "[ti:飞云之下][ar:韩红/林俊杰][al:飞云之下][by:][offset:0][00:02.22]飞云之下 - 韩红/林俊杰 (JJ Lin)[00:04.63]词：易家扬[00:05.62]曲：林俊杰[00:06.42]编曲：Terence Teo[00:07.17]制作人：林俊杰[00:07.86]人声录音：林俊杰/瞿然/Leonard Fong/李岳松/黄冠龙[00:08.52]混音：周天澈/Richard Furch[00:09.94]封面设计：方亮[00:10.18]录音棚：HONG MUSIC STUDIO[00:11.88][00:16.40]女：[00:19.88]风 让云长出花 漫天的花[00:24.81][00:26.79]无声开在乌云之下[00:29.11][00:30.62]然后 又飘到哪里呀[00:35.88][00:36.46]喔[00:36.85]男：[00:37.37]漫步在人海的人 你过得好吗[00:42.58][00:44.10]是不是又想念家[00:46.84][00:48.55]心中那炙热的梦啊[00:50.88]合：[00:52.44]它多久没说话[00:55.63][00:56.91]女：[00:58.06]在飞云之下 以为忘了的家[01:02.25]在耳里说话[01:04.21]叫我别烦心那些痛与怕[01:08.24]男：[01:09.03]喔 半路上的我 穿上回忆和风沙[01:14.90]合：[01:15.47]在飞云之下[01:16.82]女：[01:17.29]我看着海峡[01:19.89]走月光沙滩[01:21.81]我也承认我还是会想他[01:26.62]喔 且慢 前面听说风很大[01:35.81][01:42.69]男：[01:44.66][01:45.22]心 在云里摩擦 又酸又麻[01:50.48][01:51.78]但是思念在梦里爬[01:54.80][01:55.37]以后 还有谁值得等吗[02:02.06]喔[02:02.60]女：[02:02.92]孤单是件风衣 它裹起了怕[02:09.17]然而我很勇敢啊[02:12.08][02:13.48]没人记得我也没差[02:16.34]合：[02:17.70]未来在等我去拿[02:22.57]女：[02:23.24]在飞云之下 以为忘了的家[02:26.75][02:27.49]在耳里说话[02:29.42]叫我别烦心那些痛与怕[02:33.27]男：[02:34.04]喔 半路上的我 穿上回忆和风沙[02:40.05]女：[02:40.71]在飞云之下 我看着海峡[02:45.00]走月光沙滩[02:46.42]合：[02:46.95]我也承认我还是会想他[02:51.18]女：[02:51.78]喔 且慢[02:55.00]男：[02:55.49]且慢[02:56.40]合：[02:57.25]前面听说风很大[03:02.63][03:03.96]喔[03:09.48][03:18.86]女：[03:19.99]在飞云之下 以为忘了的家[03:23.48][03:24.05]在耳里说话[03:25.96]叫我别烦心那些痛与怕[03:30.02]男：[03:30.88]半路上的我 穿上回忆和风沙[03:36.93]女：[03:37.71]飞云之下 我看着海峡[03:41.00][03:41.76]走月光沙滩[03:43.68]我也承认我还是会想他[03:49.82]合：[03:51.58]且慢 前面听说风很大[03:59.42][04:00.73]喔"
            },
            {
                singer: [{name: "飞儿乐团"}], 
                songAlbum: "爱‧歌姬",
                songUrl: "http://www.ytmp3.cn/down/56453.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M0000009X2zr42vhaU.jpg?max_age=2592000", 
                songName: "月牙湾", 
                interval: "308",
                songLrc: "[ti:月牙湾][ar:飞儿乐团][al:爱 歌姬][by:][offset:0][00:00.00]月牙湾 - 飞儿乐团 (F.I.R.)[00:13.74]词：易家扬/谢宥慧[00:27.48]曲：阿沁[00:41.22]敦煌天空的沙粒[00:43.98]带着我们的记忆[00:46.73]我从半路看回去[00:49.42]这秦关漫漫好蜿踞[00:52.23]梦想穿过了西域[00:54.98]包含了多少的禅意[00:57.79]爱情像一本游记[01:00.42]我会找寻它的密语[01:02.92]看月牙湾下的泪光[01:07.74]在丝路之上被遗忘[01:12.24]是谁的心啊 孤单地留下[01:17.75]他还好吗 我多想爱他[01:23.25]那永恒的泪 凝固那一句话[01:30.51]也许可能蒸发[01:34.38]是谁的爱啊 比泪水坚强[01:39.82]轻声呼唤 就让我融化[01:45.32]每一滴雨水 演化成我翅膀[01:52.58]向着我爱的人 追吧[02:00.03][02:20.59]梦想穿过了西域[02:23.27]包含了多少的禅意[02:26.08]爱情像一本游记[02:28.83]我会找寻它的密语[02:31.46]看月牙湾下的泪光[02:35.96]在丝路之上被遗忘[02:40.53]是谁的心啊 孤单地留下[02:46.03]他还好吗 我多想爱他[02:51.55]那永恒的泪 凝固那一句话[02:58.80]也许可能蒸发[03:02.62]是谁的爱啊 比泪水坚强[03:08.12]轻声呼唤 就让我融化[03:13.62]每一滴雨水 演化成我翅膀[03:20.88]向着我爱的人 追吧[03:41.76][03:46.92]是谁的心啊 孤单地留下[03:52.29]他还好吗 我多想爱他[03:57.73]那永恒的泪 凝固那一句话[04:04.99]也许可能蒸发[04:08.80]是谁的爱啊 比泪水坚强[04:14.36]轻声呼唤 就让我融化[04:19.93]每一滴雨水 演化成我翅膀[04:27.07]向着我爱的人 追吧"
            }
        ]}
    ];

    // 歌手
    var singerList = [
        {
            listId: "0", 
            singerPic: "https://y.gtimg.cn/music/photo_new/T001R300x300M0000025NhlN2yWrP4.jpg?max_age=2592000", 
            singerName: "周杰伦", 
            list: [
            {
                singer: [{name: "周杰伦"}], 
                songAlbum: "魔杰座",
                songUrl: "http://www.ytmp3.cn/down/69854.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002Neh8l0uciQZ.jpg?max_age=2592000", 
                songName: "花海", 
                interval: "264",
                songLrc: "[ti:花海][ar:周杰伦][al:魔杰座][by:][offset:0][00:00.00]花海 - 周杰伦 (Jay Chou)[00:06.69]词：古小力/黄凌嘉[00:13.38]曲：周杰伦[00:20.07]编曲：黄雨勋[00:26.77]静止了 所有的花开[00:32.23][00:33.16]遥远了 清晰了爱[00:38.46][00:39.46]天郁闷 爱却很喜欢[00:45.20][00:45.89]那时候我不懂这叫爱[00:51.42][00:52.35]你喜欢 站在那窗台[00:58.56]你好久 都没再来[01:04.18][01:05.10]彩色的时间染上空白[01:11.39][01:12.15]是你流的泪晕开[01:17.03]不要你离开[01:20.27]距离隔不开[01:23.45]思念变成海[01:26.46]在窗外进不来[01:29.80]原谅说太快[01:33.03]爱成了阻碍[01:36.20]手中的风筝放太快回不来[01:42.63]不要你离开[01:45.84]回忆划不开[01:49.03]欠你的宠爱[01:51.76]我在等待重来[01:54.85][01:55.43]天空仍灿烂[01:58.65]它爱着大海[02:01.86]情歌被打败[02:05.02]爱已不存在[02:10.21][02:34.72]你喜欢 站在那窗台[02:40.13][02:40.97]你好久 都没再来[02:46.25][02:47.43]彩色的时间染上空白[02:53.78][02:54.65]是你流的泪晕开[02:58.82][02:59.51]不要你离开[03:02.63]距离隔不开[03:05.84]思念变成海[03:08.69]在窗外进不来[03:12.21]原谅说太快[03:15.39]爱成了阻碍[03:18.64]手中的风筝放太快回不来[03:25.11]不要你离开[03:28.25]回忆划不开[03:31.42]欠你的宠爱[03:34.34]我在等待重来[03:37.81]天空仍灿烂[03:41.07]它爱着大海[03:44.23]情歌被打败[03:46.93][03:47.45]爱已不存在"
            }
        ]},
        {
            listId: "1", 
            singerPic: "https://y.gtimg.cn/music/photo_new/T001R300x300M000001BLpXF2DyJe2.jpg?max_age=2592000", 
            singerName: "林俊杰", 
            list: [
            {
                singer: [{name: "林俊杰"}], 
                songAlbum: "JJ陆",
                songUrl: "http://www.ytmp3.cn/down/46419.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002g6zv02X7SNi.jpg?max_age=2592000", 
                songName: "醉赤壁", 
                interval: "281",
                songLrc: "[ti:醉赤壁 (《赤壁Online》网游主题曲)][ar:林俊杰][al:JJ陆][by:][offset:0][00:00.00]醉赤壁 (《赤壁Online》网游主题曲) - 林俊杰 (JJ Lin)[00:06.37]词：方文山[00:12.75]曲：林俊杰[00:19.13]编曲：谢占隽[00:25.50]落叶堆积了好几层 而我踩过青春[00:32.01]听见 前世谁在泪语纷纷[00:38.09][00:40.10]一次缘分结一次绳 我今生还在等[00:46.69]一世 就只能有一次的认真[00:53.23][00:55.92]确认过眼神 我遇上对的人[01:01.01][01:01.64]我挥剑转身 而鲜血如红唇[01:07.53][01:08.26]前朝记忆渡红尘 伤人的不是刀刃[01:14.22][01:14.80]是你转世而来的魂[01:19.26]确认过眼神 我遇上对的人[01:24.14][01:24.98]我策马出征 马蹄声如泪奔[01:31.27]青石板上的月光照进这山城[01:37.83]我一路的跟 你轮回声[01:41.24]我对你用情极深[01:45.83][02:08.05]洛阳城旁的老树根 像回忆般延伸[02:14.39]你问 经过是谁的心跳声[02:20.51][02:22.62]我拿醇酒一坛饮恨 你那千年眼神[02:29.07]是我 醉醉坠入赤壁的 伤痕[02:36.00][02:38.36]确认过眼神 我遇上对的人[02:43.35][02:44.05]我挥剑转身 而鲜血如红唇[02:49.76][02:50.66]前朝记忆渡红尘 伤人的不是刀刃[02:57.24]是你转世而来的魂[03:01.73]确认过眼神 我遇上对的人[03:06.65][03:07.46]我策马出征 马蹄声如泪奔[03:13.14][03:13.74]青石板上的月光照进这山城[03:20.36]我一路的跟 你轮回声[03:23.66]我对你用情极深[03:28.31][03:30.86]确认过眼神 我遇上对的人[03:36.18][03:36.73]我策马出征 马蹄声如泪奔[03:42.87]青石板上的月光照进这山城[03:49.75]我一路的跟 你轮回声[03:52.90]我对你用情极深[03:57.12][03:58.65]我一路的跟 你轮回声[04:01.47][04:02.09]我对你用情极深"
            }
        ]},
        {
            listId: "2", 
            singerPic: "https://y.gtimg.cn/music/photo_new/T001R300x300M000001JDzPT3JdvqK.jpg?max_age=2592000", 
            singerName: "王力宏", 
            list: [
            {
                singer: [{name: "王力宏"}], 
                songAlbum: "十八般武艺",
                songUrl: "http://www.ytmp3.cn/down/50235.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002iWU6B2ZvA8V.jpg?max_age=2592000", 
                songName: "需要人陪", 
                interval: "255",
                songLrc: "[ti:需要人陪][ar:王力宏][al:十八般武艺][by:][offset:0][00:00.00]需要人陪 (Need You Here) - 王力宏 (Leehom Wang)[00:04.47]词：王力宏[00:08.94]曲：王力宏[00:13.41]打开窗户让孤单透气[00:17.27][00:18.11]这一间屋子 如此密闭[00:22.38][00:25.23]欢呼声仍飘在空气里[00:28.90][00:29.72]像空无一人一样华丽[00:33.41][00:36.16]我 渐渐失去知觉[00:40.91][00:41.66]就当做是种自我逃避[00:46.18][00:48.05]你 飞到天的边缘[00:52.79][00:53.48]我也不猜落在何地[00:57.93][00:58.99]一个我 需要梦想[01:01.10]需要方向 需要眼泪[01:04.67]更需要 一个人来 点亮天的黑[01:09.79][01:10.51]我已经 无能为力[01:12.92]无法抗拒 无路可退[01:16.92]这无声的夜 现在的我 需要人陪[01:25.21][01:36.37]闭上眼睛 就看不清[01:39.86][01:40.83]这双人床 欠缺的 温馨[01:45.66][01:47.88]谁能 陪我 直到天明[01:52.68]穿透这片 迷蒙寂静[01:57.00][01:59.05]我 渐渐失去知觉[02:04.65]就当做是种自我逃避[02:09.83][02:10.83]你 飞到天的边缘[02:16.51]我已不猜落在何地[02:21.69]一个我 需要梦想[02:24.03]需要方向 需要眼泪[02:27.57]更需要 一个人来 点亮天的黑[02:33.07][02:33.72]我已经 无能为力[02:35.90]无法抗拒 无路可退[02:39.84]这无声的夜 现在的我 需要人陪[02:48.10][03:09.33]一个我 需要梦想[03:11.46]需要方向 需要眼泪[03:15.04]更需要 一个人来 点亮天的黑[03:20.20][03:21.13]我已经 无能为力[03:23.32]无法抗拒 无路可退[03:27.20]这无声的夜 现在的我 需要人陪"
            }
        ]},
        {
            listId: "3", 
            singerPic: "https://y.gtimg.cn/music/photo_new/T001R300x300M000001fNHEf1SFEFN.jpg?max_age=2592000", 
            singerName: "邓紫棋", 
            list: [
            {
                singer: [{name: "邓紫棋"}], 
                songAlbum: "My Secret",
                songUrl: "http://www.ytmp3.cn/down/57231.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002F059l1kCcdr.jpg?max_age=2592000", 
                songName: "我的秘密", 
                interval: "250",
                songLrc: "[ti:我的秘密][ar:G.E.M. 邓紫棋][al:My Secret][by:][offset:0][00:00.00]我的秘密 - G.E.M. 邓紫棋 (Gem Tang)[00:02.08]词：G.E.M. 邓紫棋[00:04.16]曲：G.E.M. 邓紫棋[00:06.24]编曲：Lupo Groinig[00:08.33]监制：Lupo Groinig[00:10.41]最近一直很好心情[00:13.63][00:15.05]不知道什么原因[00:17.67][00:19.59]我现在这一种心情[00:22.92][00:24.26]我想要唱给你听[00:26.91][00:27.63]Ha ha ha ha[00:35.16][00:38.10]看着窗外的小星星[00:41.42][00:42.68]心里想着我的秘密[00:45.32][00:47.25]算不算爱我不太确定[00:50.60][00:51.90]我只知道我在想你[00:54.77][00:55.38]Ha ha ha[01:02.78][01:05.41]我们之间的距离好像忽远又忽近[01:09.81]你明明不在我身边我却觉得很亲[01:14.24]Ha ha ha[01:15.41]有一种感觉我想说明[01:18.71]我心里的秘密 是你给的甜蜜[01:23.62]我们之间的距离好像一点点靠近[01:28.21]是不是你对我也有一种特殊感情[01:32.63]Ha ha ha[01:33.99]我犹豫要不要告诉你[01:37.08]我心里的秘密 是我好像喜欢了你[01:43.62][01:44.92]Ha[01:48.95][01:52.00]夜里陪着我的声音[01:55.08][01:56.50]就算沙了也动听[01:59.24][02:01.21]这一种累了的声音[02:04.51][02:05.76]是最温柔的证明[02:08.43][02:09.19]Ha[02:10.41]你是我 你是我的秘密[02:12.69]我一直偷偷想着你[02:14.91]你是我心里的秘密[02:18.44][02:19.16]我们之间的距离好像忽远又忽近[02:23.58]你明明不在我身边我却觉得很亲[02:28.16]Ha ha ha[02:29.70]有一种感觉我想说明[02:32.57]我心里的秘密 是你给的甜蜜[02:37.49]我们之间的距离好像一点点靠近[02:42.06]是不是你对我也有一种特殊感情[02:46.51]Ha ha ha[02:47.88]我犹豫要不要告诉你[02:51.01]我心里的秘密 是我好像喜欢了你[02:57.73]Ha ha ha[03:04.77]这模糊的关系 是莫名的美丽[03:11.61][03:14.41]我们之间的距离好像忽远又忽近[03:18.98]你明明不在我身边我却觉得很亲[03:23.38]Ha ha ha[03:24.78]这一刻我真的想说明[03:27.92]我心里的秘密 是你给的甜蜜[03:32.85]我们之间的距离每天一点点靠近[03:37.44]这是种别人无法理解的特殊感情[03:41.80]Ha ha ha[03:43.48]我要让全世界都清晰[03:46.34]我心里的秘密[03:48.35]是我会一直深爱着你[03:53.72][03:55.27]深爱着你[03:57.87][03:58.86]Ha ha ha"
            }
        ]},
        {
            listId: "4", 
            singerPic: "https://y.gtimg.cn/music/photo_new/T001R300x300M000002BrFgT47yIOO.jpg?max_age=2592000", 
            singerName: "ちゃた", 
            list: [
            {
                singer: [{name: "ちゃた"}], 
                songAlbum: "eclipse 改",
                songUrl: "http://www.ytmp3.cn/down/42652.mp3", 
                songPic: "https://y.gtimg.cn/music/photo_new/T002R300x300M000004OHYfb34IrnF.jpg?max_age=2592000", 
                songName: "Secret", 
                interval: "276",
                songLrc: "[ti:Secret][ar:茶太 (ちゃた)][al:eclipse 改][by:][offset:0][00:00.00]Secret - 茶太 (ちゃた)[00:10.45]词：茶太[00:20.91]曲：bassy[00:31.36]编曲：bassy[00:41.82]じゃあねと軽く手を振る[00:46.18][00:46.68]肩越しに君を見る[00:51.44][00:52.01]改札吸い込んだ切符つまむ[00:58.94]歩き出す[01:01.35][01:03.94]今日も一日ずっと我慢してた[01:11.55][01:13.92]この気持ち抑える自信が無い[01:21.68]ほんとはねもっとそばに居て[01:26.26][01:26.89]ずっと君と一緒に居たい[01:31.64]でもそんなこと言えないから[01:36.98]ため息混じりの秘密[01:42.22][02:02.72]一歩分近づいたなら[02:06.92][02:07.66]その分壁を作る[02:12.04][02:12.58]臆病者だから[02:16.86]気付かないでお願いと[02:22.26][02:24.79]この距離が居心地良すぎるから[02:32.35][02:34.94]壊れないようにと祈ってみる[02:42.39]ほんとはねもっとそばに居て[02:47.68]君を独り占めしたいんだ[02:52.41]でもそんなこと言えないから[02:57.82]ため息混じりの秘密[03:04.89]日を追って膨らんでく気持ち[03:12.80][03:13.31]笑顔の下隠しちゃうんだいつも[03:22.89]振り向いた先にいる君が[03:28.09]無邪気に笑うから愛しくて[03:32.82]人込みの中で手を振った[03:38.22]また明日ねと笑いながら[03:43.75]ほんとはもっとそばに居て[03:48.41]ずっと君と一緒に居たい[03:52.99]でもそんなこと言えないから[03:58.46]ため息混じりの秘密"
            }
        ]}
    ];

    // MV
    var mvList = [
        {
            mvName: "那些花儿",
            mvPicUrl: "http://y.gtimg.cn/music/photo_new/T015R640x360M101000QY9sl40w2IL.jpg",
            mvSrcList: [
                "http://hc.yinyuetai.com/uploads/videos/common/BE29016417BE8AA49858A88D1B7DF365.mp4?sc=3bd21427d44dbbbf&br=777&vid=3233814&aid=269&area=ML&vst=3"
            ]
        },
        {
            mvName: "故乡",
            mvPicUrl: "http://imgcdn.170mv.com/video/mv/180720/0/-M-7180bb636ee0c4fe2509019c0aa2a06a_640x360.jpg?imageView2/format/jpg/q/40",
            mvSrcList: [
                "http://www.170mv.com/tool/jiexi/ajax/pid/13150/vid/3253990.mp4"
            ]
        },
        {
            mvName: "我要你",
            mvPicUrl: "http://y.gtimg.cn/music/photo_new/T015R640x360M101003P7xhX3eBSKO.jpg",
            mvSrcList: [
                "http://hc.yinyuetai.com/uploads/videos/common/740C01580E4D6EDDAB4DB0E4A1D1CE59.flv"
            ]
        },
        {
            mvName: "最爱",
            mvPicUrl: "http://y.gtimg.cn/music/photo_new/T015R640x360M000002yOotp3Zy9js.jpg",
            mvSrcList: [
                "http://hc.yinyuetai.com/uploads/videos/common/EC7801322A797C9B03FA43E45A7A6B3E.flv"
            ]
        },
        {
            mvName: "星之容器",
            mvPicUrl: "http://y.gtimg.cn/music/photo_new/T015R640x360M0000037Lsaw2bhp0Y.jpg?max_age=2592000",
            mvSrcList: [
                "http://220.194.238.108/9/p/i/e/x/piexmkcdmsydfimujgboqvhyrlgsin/hc.yinyuetai.com/6ABC0152FF38291040CBBAC21BC374B9.flv"
            ]
        },
        {
            mvName: "宝石",
            mvPicUrl: "https://timgmb05.bdimg.com/timg?searchbox_feed&quality=100&wh_rate=0&size=b800_1000&ref=http%3A%2F%2Fwww.baidu.com&sec=1557846459&di=5f3b8d783d8acaf43a0902269488df29&src=http%3A%2F%2Fpic.rmb.bdstatic.com%2Fe79c4a607c47ce2fceb8c17e3e02568c.jpg",
            mvSrcList: [
                "https://vd2.bdstatic.com/mda-hmj3qcbq25gy9gie/mda-hmj3qcbq25gy9gie.mp4"
            ]
        },
        {
            mvName: "水星记",
            mvPicUrl: "http://y.gtimg.cn/music/photo_new/T015R640x360M0000029Bcbr4O4l6W.jpg",
            mvSrcList: [
                "http://hc.yinyuetai.com/uploads/videos/common/D9220158E3C8A1F4B8D7604C3875C052.mp4"
            ]
        },
        {
            mvName: "从你的全世界来过",
            mvPicUrl: "http://imgcdn.170mv.com/video/mv/160928/2690027/-M-fe8c4d2ca61259115737b61702434701_640x360.jpg?imageView2/format/jpg/q/40",
            mvSrcList: [
                "http://www.170mv.com/tool/jiexi/ajax/pid/12420/vid/2690027.mp4"
            ]
        }
    ];

    // 此部分为加载部分
    load();

    function load() {
        newSongLoad();
        songListLoad();
        singerLoad();
        mvLoad();
    }

    // 轮播图加载略(因为用本地图片)

    // 新歌加载
    function newSongLoad() {
        for (var i = 0; i < newSongList.length; i++) {
            var newSong = newSongList[i].list[0];
            // singer的结构是一个数组
            var singers = newSong.singer;
            var author = "";
            for (var s = 0; s < singers.length; s++) {
                author += singers[s].name + "&";
            }
            if (author.length > 0) {
                author = author.substr(0, author.length - 1);
            }
            $("#ns" + i + " .content .titleAndAuthor").text(newSong.songName + "-" + author);
            $("#ns" + i + " .content .time").text(intervalFormat(newSong.interval));
            $("#ns" + i + " .content .album").text(newSong.songAlbum);
            $("#ns" + i + " .content .mid").text(newSong.songMid);
            $("#ns" + i).css("background-image", "url(" + newSong.songPic + ")");
        }
    }

    // 歌单加载
    function songListLoad() {
        for (var i = 1; i < songListList.length; i++) {
            $(".hotSongList .picBack #sl" + i).css("background-image", "url(" + songListList[i].listPic + ")");
            $(".hotSongList .picBack #sl" + i).parent().siblings(".info").text(songListList[i].listName);
            $(".hotSongList .picBack #sl" + i).parent().siblings(".listId").text(songListList[i].listId);
        }
    }

    // 歌手加载
    function singerLoad() {
        for (var i = 0; i < singerList.length; i++) {
            $(".authorListsDiv .authorLists .author #a" + i).css("background-image", "url(" + singerList[i].singerPic + ")");
            $(".authorListsDiv .authorLists .author #a" + i).siblings(".authorName").text(singerList[i].singerName);
        }
    }

    // mv加载
    function mvLoad() {
        for (var i = 0 ; i < mvList.length; i++) {
            // 背景静态图片加载
            $(".hotMVListsDiv .hotMVLists .hotMV #mv" + i).css("background-image", "url(" + mvList[i].mvPicUrl + ")");
            // video属性poster图片加载
            $(".hotMVListsDiv .hotMVLists .hotMV #mv" + i + " video").attr("poster", mvList[i].mvPicUrl);
            // 视频播放源加载
            var src;
            for (var j = 0; j < mvList[i].mvSrcList.length; j++) {
                src = "<source src='" + mvList[i].mvSrcList[j] + "' type='video/mp4'>";
                $(src).appendTo($(".hotMVListsDiv .hotMVLists .hotMV #mv" + i + " video"));
            }
            // MV名称加载
            $(".hotMVListsDiv .hotMVLists .hotMV #mv" + i).parent().siblings(".MVName").text(mvList[i].mvName);
        }
    }

    // 以下为播放逻辑和定时器

    startSyncStatusTimer();

    function startAutoPlayTimer() {
        initAutoPlay();
    }

    function stopAutoPlayTimer() {
        clearInterval(songChangeTimer);
        songChangeTimer = null;
    }

    function startLyricTimer() {
        lyricTimer = setInterval(locateLyric, 300);
    }

    function stopLyricTimer() {
        clearInterval(lyricTimer);
        lyricTimer = null;
    }

    function startSyncStatusTimer() {
        timer = setInterval(changeSyncStatus, 500);
    }

    function initAutoPlay() {
        if (songChangeTimer !== null) {
            clearInterval(songChangeTimer);
            songChangeTimer = null;
        }
        setTimeout(() => {
            songChangeTimer = setInterval(autoPlayNext, 300);
        }, 1000);
    }

    function changeSyncStatus() {
        if (syncStatus === 1) {
            syncStatus = 0;
        }
    }

    function autoPlayNext() {
        if (songList.length <= 0) {
            return;
        }
        if (isSongEnd()) {
            clearInterval(rotateTimer);
            rotateTimer = null;
            if (playType === 1) {
                clearInterval(songChangeTimer);
                songChangeTimer = null;
            } else {
                if (songChangeTimer === null) {
                    songChangeTimer = setInterval(autoPlayNext, 300);
                }
                var next = document.getElementById("next");
                next.click();
            }
        }
    }

    function play() {
        var player = document.getElementById("musicAudio");
        player.play();
        $(".songOperator #start").css("background-position", "0 -42px");
        isPlaying = true;
        canPlay = true;
    }

    function useTimer() {
        // 设置开始图片
        $(".songOperator #start").css("background-position", "0 0");
        // 停止定时器
        stopAutoPlayTimer();
        // 停止唱片转动
        stopRecordRoateTimer("end");
        // 停止歌词定时器
        stopLyricTimer();

        // 设置暂停图片
        $(".songOperator #start").css("background-position", "0 -42px");
        // 转动唱片
        startRecordRoateTimer();
        // 启动自动播放定时器
        startAutoPlayTimer();
        // 启动歌词定时器
        startLyricTimer();
    }

    // 轮播图播放
	$("#m_box ul li").click(function() {
        var id = parseInt($(this).attr("id").replace("imgCard", ""));
        if (id < 0 || id > 4) {
            layer.msg("页面更新这里没来得及修改", {
                offset: "200px"
            });
        } else {
            layer.msg("该部分歌曲播放来源还在完善, 请浏览下方歌曲", {
                offset: "200px"
            });
            return;
            var slider = sliderList[id].list;
            addSongList(slider);
            doubleClickPlay();
            removeListSong();
            play();
            useTimer();
        }
    });
    
    // 新歌播放
    $(".newSong .playIcon").click(function() {
        doubleClickPlay();
        removeListSong();
        var listId = $(this).parent().parent().attr("id").replace("ns", "");
        newSongPlay(listId);
    });
    
    
    // 双击列表歌曲播放歌曲
    function doubleClickPlay() {
        $(".playerDiv .playerList .song").dblclick(function() {
            var toPlayUrl = $(this).children(".songUrl").text();
            var songName = $(this).children(".songName").text();
            var author = $(this).children(".author").text();
            var songAlbum = $(this).children(".songAlbum").text();
            var songPic = $(this).children(".songPic").text();
            var songLrc = $(this).children(".songLrc").text();
            var player = document.getElementById("musicAudio");
            if (syncStatus !== 0) {
                return;
            }
            player.src = toPlayUrl;
            currentLrc = songLrc;
            loadLyric(currentLrc);
            syncStatus = 1;
            // 将播放图片置为暂停图片
            $(".songOperator #start").css("background-position", "0 -42px");
            // 设置当前歌曲图片
            $(".player .songPic").css("background-image", "url(" + songPic + ")");
            // 设置最大时长
            $(".songTime #maxTime").text($(this).children(".songTime").text());
            // 设置当前播放歌名及歌手
            $(".songTime #songNameAndAuthor").text($(this).children(".songNameAndAuthor").text());
            // 设置歌词背景和唱片背景
            $(".musicLyric .lyricDivBack").css("background-image", "url(" + songPic + ")");
            $(".musicLyric .songPic").css("background-image", "url(" + songPic + ")");
            $(".musicLyric .right .songInfo .songName").text(songName);
            $(".musicLyric .right .songInfo .singer").text(author);
            $(".musicLyric .right .songInfo .songAlbum").text(songAlbum);
            play();
            useTimer();
        });
    }

    // 移除歌曲（存在问题）
    function removeListSong() {
        $(".playerDiv .playerList .song .removeSong").click(function() {
            console.log("移除的歌曲:" + $(this).parent().children(".songNameAndSinger").text());
            $(this).parent().remove();
            // 找出待移除歌曲在数组中的下标
            var removeSongUrl = $(this).siblings(".songUrl").text();
            var removeIndex = findSongIndex(removeSongUrl);
            // songList.splice(removeIndex, 1);
            // 如果移除的歌曲为当前播放的歌曲则暂停播放
            var curSongUrl = $("#musicAudio").attr("src");
            var player = document.getElementById("musicAudio");
            if (curSongUrl === removeSongUrl) {
                player.pause();
                isPlaying = false;
                $("#musicAudio").attr("src", "");
                $(".songOperator #start").css("background-position", "0 0");
            }
            console.log("移除后列表还有:" + songList.length + "首歌");
        });
    }

    // 新歌播放
    function newSongPlay(listId) {
        var newSong = newSongList[listId].list[0];
        var url = newSong.songUrl;
        var lrc = newSong.songLrc;
        currentLrc = lrc;
        loadLyric(currentLrc);
        var pic = newSong.songPic;
        // 将所点击的歌曲添加到歌曲列表中
        var songName = newSong.songName;
        var author = "";
        var authors = newSong.singer;
        if (authors !== undefined || authors !== null) {
            for (var a = 0; a < authors.length; a++) {
                author += authors[a].name + "&";
            }
            if (author.length > 0) {
                author = author.substr(0, author.length - 1);
            }
        }
        var titleAndAuthor = songName + "-" + author;
        var time = intervalFormat(newSong.interval);
        var albumName = newSong.songAlbum;
        $(".songTime #songNameAndAuthor").text(titleAndAuthor);
        $(".musicLyric .right .songInfo .songName").text(songName);
        $(".musicLyric .right .songInfo .singer").text(author);
        $(".musicLyric .right .songInfo .songAlbum").text(albumName);
        var songNameAndSinger = "<span class='songNameAndSinger'>" + titleAndAuthor + "</span>";
        // 专辑暂不显示在列表里
        var songAlbum = "<span class='songAlbum'>" + albumName + "</span>";
        var songTime = "<span class='songTime'>" + time + "</span>";
        var songLrc = "<span class='songLrc' style='display: none;'>" + lrc + "</span>";
        var songPic = "<span class='songPic' style='display: none;'>" + pic + "</span>";
        var songUrl = "<span class='songUrl' style='display: none;'>" + url + "</span>";
        // 列表移除暂时有问题
        var removeSong = "<span class='removeSong'>X</span>";
        var song = "<div class='song'>" + songNameAndSinger + songAlbum + songTime + songLrc + songPic + songUrl + "</div>";
        var songJson = JSON.stringify({
            title: songName,
            author: author,
            titleAndAuthor: titleAndAuthor,
            time: time,
            albumName: albumName,
            url: url,
            pic: pic,
            lrc: lrc
        });
        if (findSongIndex(url) === -1) {
            $(song).appendTo($(".playerList"));
            songList.push(songJson); // 添加前校验是否存在这首歌曲
            if (url !== "" | url !== null || url !== undefined) {
                $("#musicAudio").attr("src", url);
                $(".songTime #maxTime").text(time);
                $(".player .songPic").css("background-image", "url(" + pic + ")");
                // 将播放图片置为暂停图片
                $(".songOperator #start").css("background-position", "0 -42px");
            } else {
                layer.msg("播放地址无效", {
                    offset: "200px"
                });
            }
        } else {
            layer.msg("歌曲已存在于列表中", {
                offset: "200px"
            });
        }
        play();
        useTimer();
    }

    // 将播放时间秒转成(xx:xx)的形式
    function intervalFormat(time) {
        var minute = Math.floor(time / 60);
        var second = Math.floor(time % 60);
        if (minute < 10) {
            minute = "0" + minute;
        }
        if (second < 10) {
            second = "0" + second;
        }
        return minute + ":" + second;
    }

    // 暂停歌曲
    $(".songOperator #start").click(function() {
        var player = document.getElementById("musicAudio");
        if (!isPlaying) {
            if (songList.length === 0) {
                layer.msg("列表都没歌，你听个鬼哦", {
                    offset: "200px"
                });
            } else {
                player.play();
                isPlaying = true;
                // 设置暂停图片
                $(this).css("background-position", "0 -42px");
                // 转动唱片
                startRecordRoateTimer();
                // 启动定时器
                startAutoPlayTimer();
            }
        } else {
            $(this).css("background-position", "0 0");
            player.pause();
            isPlaying = false;
            stopAutoPlayTimer();
            stopRecordRoateTimer();
        }
    });

    // 上一首
    $(".songOperator #last").click(function() {
        if (songList.length === 0) {
            layer.msg("列表都没歌，上一首会有用？", {
                offset: "200px"
            });
        } else {
            // 获得当前播放歌曲的url
            var curSongUrl = $("#musicAudio").attr("src");
            var curIndex = findSongIndex(curSongUrl);
            if (curIndex >= 0) {
                curIndex--;
                // 到列表的第一首歌了
                if (curIndex < 0) {
                    curIndex = songList.length - 1; // 跳到最后一首歌
                }
                var json = toJson(songList[curIndex]);
                var player = document.getElementById("musicAudio");
                player.src = json.url;
                currentLrc = json.lrc;
                loadLyric(currentLrc);
                // 歌曲信息的设置
                $(".player .songPic").css("background-image", "url(" + json.pic + ")");
                $(".songTime #maxTime").text(json.time);
                $(".songTime #songNameAndAuthor").text(json.titleAndAuthor);
                // 歌词背景图片和唱片背景图片
                $(".musicLyric .lyricDivBack").css("background-image", "url(" + json.pic + ")");
                $(".musicLyric .songPic").css("background-image", "url(" + json.pic + ")");
                $(".musicLyric .right .songInfo .songName").text(json.title);
                $(".musicLyric .right .songInfo .singer").text(json.author);
                $(".musicLyric .right .songInfo .songAlbum").text(json.albumName);
                doubleClickPlay();
                removeListSong();
                play();
                useTimer();
            } else {
                layer.msg("为什么明明有一首以上的歌曲，但是没有切换? 当然是出bug了啊", {
                    offset: "200px"
                });
            }
        }
    });

    // 下一首
    $(".songOperator #next").click(function() {
        if (songList.length === 0) {
            layer.msg("列表都没歌，下一首会有用？", {
                offset: "200px"
            });
        } else {
            // 获得当前播放歌曲的url
            var curSongUrl = $("#musicAudio").attr("src");
            var curIndex = findSongIndex(curSongUrl);
            if (curIndex >= 0) {
                curIndex++;
                // 到列表的最后一首了
                if (curIndex === songList.length) {
                    curIndex = 0; // 跳到第一首
                }
                var json = toJson(songList[curIndex]);
                var player = document.getElementById("musicAudio");
                player.src = json.url;
                currentLrc = json.lrc;
                loadLyric(currentLrc);
                // 歌曲信息的设置
                $(".player .songPic").css("background-image", "url(" + json.pic + ")");
                $(".songTime #maxTime").text(json.time);
                $(".songTime #songNameAndAuthor").text(json.titleAndAuthor);
                // 歌词背景图片和唱片背景图片
                $(".musicLyric .lyricDivBack").css("background-image", "url(" + json.pic + ")");
                $(".musicLyric .songPic").css("background-image", "url(" + json.pic + ")");
                $(".musicLyric .right .songInfo .songName").text(json.title);
                $(".musicLyric .right .songInfo .singer").text(json.author);
                $(".musicLyric .right .songInfo .songAlbum").text(json.albumName);
                doubleClickPlay();
                removeListSong();
                play();
                useTimer();
            } else {
                layer.msg("为什么明明有一首以上的歌曲，但是没有切换? 当然是出bug了啊", {
                    offset: "200px"
                });
            }
        }
    });

    // 终止歌曲
    $(".songOperator #end").click(function() {
        // 将歌曲的当前时间设置为0， 并将歌曲暂停播放
        var player = document.getElementById("musicAudio");
        player.pause();
        player.currentTime = 0;
        // 将暂停图片置为播放图片
        $(".songOperator #start").css("background-position", "0 0");
        isPlaying = false;
        stopAutoPlayTimer();
        stopRecordRoateTimer("end");
    });

    function findSongIndex(url) {
        for (var i = 0; i < songList.length; i++) {
            if (toJson(songList[i]).url === url) {
                return i;
            }
        }
        return -1;
    }

    function toJson(v) {
        return eval("(" + v + ")");
    }

    function isSongEnd() {
        var player = document.getElementById("musicAudio");
        var ended = player.ended;
        var currentTime = player.currentTime === 0;
        var isEnd = ended || currentTime;
        return isEnd;
    }

    // 切换播放方式
    $(".songOperator #playType").click(function() {
        var player = document.getElementById("musicAudio");
        // 0 列表循环 1 单曲循环 2 随机播放
        if (playType === 0) {
            player.loop = "loop";
            playType = 1;
            layer.msg("单曲循环图标被你点没了", {
                offset: "200px"
            });
            $(this).css("background-position", "-200px -200px");
        } else if (playType === 1) {
            player.loop = "";
            playType = 2;
            layer.msg("随机播放", {
                offset: "200px"
            });
            $(this).css("background-position", "0 -270px");
            // 随机列表
            shuffleSongList();
        } else if (playType === 2) {
            player.loop = "";
            playType = 0;
            layer.msg("列表循环", {
                offset: "200px"
            });
            $(this).css("background-position", "0 -290px");
            // 将列表还原
            resetSongList();
        }
    });

    function shuffleSongList() {
        // 洗牌原列表
        shuffleSwap(songList);
    }

    function shuffleSwap(arr) {
        if(arr.length == 1) return arr;
        let i = arr.length;
        while(--i > 1) {
          let j = Math.floor(Math.random() * (i+1));
          /*
          //原始写法
          let tmp = arr[i];
          arr[i] = arr[j];
          arr[j] = tmp;
          */
          //es6的写法
          [arr[i], arr[j]] = [arr[j], arr[i]];
        }
        return arr;
    }

    function resetSongList() {
        for (var i = 0; i < bakSongList.length; i++) {
            songList[i] = bakSongList[i];
        }
    }

    // 歌词部分
    $(".player .songPic .lrcShow .btn").click(function() {
        if (!showLyric) {
            // 每次点击歌词显示不会多次加载
            if (!isLoadLyric) {
                // loadLyric(currentLrc);
                isLoadLyric = true;
            }
            // startLyricTimer();
            $(".musicLyric").css("display", "");
            $(".notLyric").css("display", "none");
            $(".musicPlayer").css("top", "280px");
            // 歌曲的图片加载
            var curSongPic = $(this).parent().parent().css("background-image");
            $(".musicLyric .lyricDivBack").css("background-image", curSongPic);
            $(".musicLyric .songPic").css("background-image", curSongPic);
            showLyric = true;
        } else {
            // stopLyricTimer();
            $(".musicLyric").css("display", "none");
            $(".notLyric").css("display", "");
            $(".musicPlayer").css("top", "150px");
            showLyric = false;
        }
    });

    // 解析歌词
    function loadLyric(lrc) {
        lrcList = new Array();
        lrcTimeList = new Array();
        $("#lyric").empty();
        var lrcListTmp = lrc.split('[');
        // 前面补充3个span
        for (var i = 0; i < 3; i++) {
            $("<span class='line'>&nbsp;</span>").appendTo($("#lyric"));
        }
        for (var i = 1; i < lrcListTmp.length; i++) {
            var b = lrcListTmp[i].split(']');
            lrcList.push(b);
            $("<span class='line' id='l" + (i - 1) + "'>" + b[1] + "</span>").appendTo($("#lyric"));
        }
        // 后面补充生成5个span
        for (var i = lrcListTmp.length; i < lrcListTmp.length + 5; i++) {
            $("<span class='line' id='l" + (i - 1) + "'>&nbsp;</span>").appendTo($("#lyric"));
        }
        var maxTime;
        for (var i = 0; i < lrcList.length; i++) {
            var d = lrcList[i][0].split('.');
            lrcTimeList.push(d[0]);
            maxTime = d[0];
            $("<span class='time' id='t" + i + "'>" + timeStr2Second(d[0]) + "</span>").appendTo($("#l" + i));
        }
        for (var i = lrcList.length; i < lrcList.length + 5; i++) {
            lrcTimeList.push(maxTime);
            $("<span class='time' id='t" + i + "'>" + timeStr2Second(maxTime) + "</span>").appendTo($("#l" + i));
        }
    }

    // 定位歌词行
    function locateLyric() {
        var lyric = document.getElementById("lyric");
        var player = document.getElementById("musicAudio");
        var currentTime = player.currentTime;
        if (player.currentTime < 1) {
            lyric.scrollTo(0, 0);
        }
        // 找到当前时间对应的行
        for ( var i = 0; i < lrcTimeList.length; i++) {
            if (i + 1 < lrcList.length) {
                if (currentTime >= timeStr2Second(lrcTimeList[i]) && currentTime <= timeStr2Second(lrcTimeList[i + 1])) {
                    $("#lyric #l" + i).addClass("lyricColor");
                    curLyricLocation = parseInt((i) * $("#lyric .line").css("height").replace("px", ""));
                    lyric.scrollTo(0, curLyricLocation);
                } else {
                    $("#lyric #l" + i).removeClass("lyricColor");
                }
            } else if (i + 1 === lrcList.length) {
                if (currentTime >= timeStr2Second(lrcTimeList[i])) {
                    $("#lyric #l" + i).addClass("lyricColor");
                    curLyricLocation = parseInt((i) * $("#lyric .line").css("height").replace("px", ""));
                    lyric.scrollTo(0, curLyricLocation);
                } else {
                    $("#lyric #l" + i).removeClass("lyricColor");
                }
            }
        }
    }

    function timeStr2Second(time) {
        var tmp = time.split(":");
        var minute = parseInt(tmp[0]);
        var second = parseInt(tmp[1]);
        return minute * 60 + second;
    }

    // 唱针旋转样式(包括了唱片的旋转)
    function startRecordRoateTimer() {
        if (isPlaying || !isSongEnd()) {
            $(".musicLyric .stylus").css("-webkit-transform", "rotate(45deg)");
            $(".musicLyric .stylus").css("-moz-transform", "rotate(45deg)");
            $(".musicLyric .stylus").css("-ms-transform", "rotate(45deg)");
            $(".musicLyric .stylus").css("transform", "rotate(45deg)");
            rotateTimer = setInterval(picRotate, 100);
        }
    }

    // 唱片的旋转
    function picRotate() {
        rotateCircle++;
        $(".musicLyric .songPicOutter").css("transform", "rotate(" + rotateCircle * 1.8 * 1 + "deg)");
        $(".musicLyric .songPicOutter").css("transition", ".1s linear");
        $(".musicLyric .songPic").css("transform", "rotate(" + rotateCircle * 1.8 * 1 + "deg)");
        $(".musicLyric .songPic").css("transition", ".1s linear");
    }

    // 停止旋转
    function stopRecordRoateTimer(type) {
        if (!isPlaying || isSongEnd()) {
            clearInterval(rotateTimer);
            rotateTimer = null;
            if (type === "end") {
                rotateCircle = 0;
                $(".musicLyric .songPicOutter").css("transform", "rotate(0)");
                $(".musicLyric .songPic").css("transform", "rotate(0)");
            }
            $(".musicLyric .stylus").css("-webkit-transform", "rotate(0deg)");
            $(".musicLyric .stylus").css("-moz-transform", "rotate(0deg)");
            $(".musicLyric .stylus").css("-ms-transform", "rotate(0deg)");
            $(".musicLyric .stylus").css("transform", "rotate(0deg)");
        }
    }
    
    // 歌单播放
    $(".hotSongLists .hotSongList").click(function() {
        var listId = $(this).children(".listId").text();
        if (listId === "" || listId === undefined || listId === null) {
            layer.msg("这个歌单就不给你听", {
                offset: "200px"
            });
            return;
        }
        var songs = songListList[listId].list;
        addSongList(songs);
        doubleClickPlay();
        removeListSong();
        play();
        useTimer();
    });

    // 歌手
    $(".authorLists .author").click(function() {
        var listId = $(this).children(".authorPic").attr("id").replace("a", "");
        var song = singerList[listId].list;
        addSong(song[0]);
        doubleClickPlay();
        removeListSong();
        play();
        useTimer();
    });

    function addSong(vSongJson) {
        var author = "";
        var authors = vSongJson.singer;
        if (authors !== undefined || authors !== null) {
            for (var a = 0; a < authors.length; a++) {
                author += authors[a].name + "&";
            }
            if (author.length > 0) {
                author = author.substr(0, author.length - 1);
            }
        }
        var lrc = vSongJson.songLrc;
        var pic = vSongJson.songPic;
        var url = vSongJson.songUrl;
        var title = vSongJson.songName;
        var titleAndAuthor = title + "-" + author;
        var time = intervalFormat(vSongJson.interval);
        var albumName = vSongJson.songAlbum;
        var songNameAndAuthor = "<span class='songNameAndAuthor'>" + titleAndAuthor + "</span>";
        var songName = "<span class='songName' style='display: none;'>" + title + "</span>";
        var songAuthor = "<span class='author' style='display: none;'>" + author + "</span>";
        var songAlbum = "<span class='songAlbum'>" + albumName + "</span>";
        var songTime = "<span class='songTime'>" + time + "</span>";
        var songLrc = "<span class='songLrc' style='display: none;'>" + lrc + "</span>";
        var songPic = "<span class='songPic' style='display: none;'>" + pic + "</span>";
        var songUrl = "<span class='songUrl' style='display: none;'>" + url + "</span>";
        // 列表移除存在问题
        var removeSong = "<span class='removeSong'>X</span>";
        var song = "<div class='song'>" + songNameAndAuthor + songName + songAuthor + songAlbum + songTime + songLrc + songPic + songUrl + "</div>";
        var songJson = JSON.stringify({
            title: title,
            author: author,
            titleAndAuthor: titleAndAuthor,
            time: time,
            albumName: albumName,
            url: url,
            pic: pic,
            lrc: lrc
        });
        if (findSongIndex(vSongJson.songUrl) === -1) {
            songList.push(songJson);
            bakSongList.push(songJson);
            $(song).appendTo($(".playerList"));
            if (url !== "" | url !== null || url !== undefined) {
                var player = document.getElementById("musicAudio");
                player.src = url;
                $(".player .songPic").css("background-image", "url(" + pic + ")");
                $(".songTime #maxTime").text(time);
                $(".songTime #songNameAndSinger").text(titleAndAuthor);
                $(".musicLyric .right .songInfo .songName").text(title);
                $(".musicLyric .right .songInfo .singer").text(author);
                $(".musicLyric .right .songInfo .songAlbum").text(albumName);
                currentLrc = lrc;
                loadLyric(currentLrc);
                // 将播放图片置为暂停图片
                $(".songOperator #start").css("background-position", "0 -42px");
            } else {
                layer.msg("播放地址无效", {
                    offset: "200px"
                });
            }
        } else {
            layer.msg("歌曲已存在于列表中", {
                offset: "200px"
            });
        }
    }

    // 批量导入(顺序导入时限制了播放为导入首位的歌曲)
    function addSongList(songs) {
        for (var i = 0; i < songs.length; i++) {
            var author = "";
            var authors = songs[i].singer;
            if (authors !== undefined || authors !== null) {
                for (var a = 0; a < authors.length; a++) {
                    author += authors[a].name + "&";
                }
                if (author.length > 0) {
                    author = author.substr(0, author.length - 1);
                }
            }
            var lrc = songs[i].songLrc;
            var pic = songs[i].songPic;
            var url = songs[i].songUrl;
            var title = songs[i].songName;
            var titleAndAuthor = title + "-" + author;
            var time = intervalFormat(songs[i].interval);
            var albumName = songs[i].songAlbum;
            var songNameAndAuthor = "<span class='songNameAndAuthor'>" + titleAndAuthor + "</span>";
            var songName = "<span class='songName' style='display: none;'>" + title + "</span>";
            var songAuthor = "<span class='author' style='display: none;'>" + author + "</span>";
            var songAlbum = "<span class='songAlbum'>" + albumName + "</span>";
            var songTime = "<span class='songTime'>" + time + "</span>";
            var songLrc = "<span class='songLrc' style='display: none;'>" + lrc + "</span>";
            var songPic = "<span class='songPic' style='display: none;'>" + pic + "</span>";
            var songUrl = "<span class='songUrl' style='display: none;'>" + url + "</span>";
            // 列表移除存在问题
            var removeSong = "<span class='removeSong'>X</span>";
            var song = "<div class='song'>" + songNameAndAuthor + songName + songAuthor + songAlbum + songTime + songLrc + songPic + songUrl + "</div>";
            var songJson = JSON.stringify({
                title: title,
                author: author,
                titleAndAuthor: titleAndAuthor,
                time: time,
                albumName: albumName,
                url: url,
                pic: pic,
                lrc: lrc
            });
            if (findSongIndex(songs[i].songUrl) === -1) {
                songList.push(songJson);
                bakSongList.push(songJson);
                $(song).appendTo($(".playerList"));
                if (url !== "" | url !== null || url !== undefined) {
                    // 只设置第一首歌曲，即添加后默认播放第一首歌曲
                    if (i === 0) {
                        var player = document.getElementById("musicAudio");
                        player.src = url;
                        $(".player .songPic").css("background-image", "url(" + pic + ")");
                        $(".songTime #maxTime").text(time);
                        $(".songTime #songNameAndAuthor").text(titleAndAuthor);
                        $(".musicLyric .right .songInfo .songName").text(title);
                        $(".musicLyric .right .songInfo .singer").text(author);
                        $(".musicLyric .right .songInfo .songAlbum").text(albumName);
                        currentLrc = lrc;
                        loadLyric(currentLrc);
                    }
                    // 将播放图片置为暂停图片
                    $(".songOperator #start").css("background-position", "0 -42px");
                } else {
                    layer.msg("播放地址无效", {
                        offset: "200px"
                    });
                }
            } else {
                layer.msg("歌曲已存在于列表中", {
                    offset: "200px"
                });
            }
        }
    }

    // 回到顶部
    $("#toTop").click(function() {
        $("html, body").animate({
            scrollTop: 0
        }, 500);
    });
})